user-manual.org
# Copyright 2023 Linus Arver
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#      http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

#+title: User Manual
#+SETUPFILE: lilac.theme
#+PROPERTY: header-args :noweb no-export
#+OPTIONS: ^:{}
#+OPTIONS: H:5

NOTE: This manual is not yet ready for consumption. There are many missing
pieces (how to install, how to set up your configuration files, etc). Once the
main architecture settles down in the [[file:developer-manual.html][Developer Manual]] this User Manual will be
revised accordingly.

* Concepts

Ultimately, you will want to provide =melbyc= with a Lua configuration file,
which will in turn provide it to =melbyd=. Most of your configuration will be
spent defining resources for the Standard Resource Service that =melbyd=
provides. This is because SRS generalizes the reading of data through shell
commands that would normally be run inside a shell script.

** Standard Resource Service (SRS)

Melby allows you to declaratively define a *resource* using the Standard
Resource Service. Each resource is a collection of shell commands that when
executed and parsed can create a single "object" of some sort, where the object
is a collection of key-value pairs (also known as a hashmap or dictionary). One
example could be a Git type that has various information about a particular Git
repo on disk at some path. Each object is associated with a type, and this
*type* information is called the =resource_type=.

Each resource also needs a way to distinguish itself against other resources of
the same type. The =resource_id= fulfills this role. For example, for the Git
resource type, the =resource_id= could be the unique path on disk for that Git
repo.

* Configuration example

Let's look at what a sample configuration might look like. The only requirement
is that we return a table (in this example, named =Config=) with a =view=
function. This function takes an =env= variable which is a table whose keys and
values reflect the environment variables that =melbyc= sees when it is invoked
by the user.

