user-manual.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>User Manual</title>
<meta name="author" content="Linus Arver" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.googleapis.com" />
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin />
<link rel="stylesheet" href="https://fonts.googleapis.com/css2?family=Source+Serif+Pro:wght@400;700&family=Source+Sans+Pro:wght@400;700&family=Source+Code+Pro">
<link rel="stylesheet" type="text/css" href="syntax-highlighting.css"/>
<link rel="stylesheet" type="text/css" href="lilac.css" />
<!-- LILAC_HTML_HEAD -->
</head>
<body>
<div id="content" class="content">
<h1 class="title">User Manual</h1>
<div id="table-of-contents" role="doc-toc">

<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-Concepts">1. Concepts</a>
<ul>
<li><a href="#h-Standard-Resource-Service--SRS">1.1. Standard Resource Service (SRS)</a></li>
</ul>
</li>
<li><a href="#h-Configuration-example">2. Configuration example</a>
<ul>
<li><a href="#h-Main-configuration">2.1. Main configuration</a></li>
<li><a href="#h-Git-resource">2.2. Git resource</a>
<ul>
<li>
<ul>
<li><a href="#h-Fake">2.2.0.1. Fake</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#h-Kubernetes---kubectl-">2.3. Kubernetes (<code>kubectl</code>)</a>
<ul>
<li><a href="#h-Things-we-have-to-implement">2.3.1. Things we have to implement</a>
<ul>
<li><a href="#h-IN-PROGRESS-SRS--create-time-based-staleness-flagger--easy">2.3.1.1. IN-PROGRESS SRS: create time-based staleness flagger (easy)</a></li>
<li><a href="#h-SRS--create-a-command-timeout-for-shell-commands-that-take-too-long-or-error-out">2.3.1.2. <span class="todo TODO">TODO</span> SRS: create a command timeout for shell commands that take too long or error out</a></li>
</ul>
</li>
<li><a href="#h-Implementation-for--KubeCurrent-lua---get-current-context-namespace">2.3.2. Implementation for <code>KubeCurrent.lua</code> (get current context/namespace)</a>
<ul>
<li><a href="#h-Fake-1">2.3.2.1. Fake</a></li>
</ul>
</li>
<li><a href="#h-Fake--kubectl--for-the-test-environment">2.3.3. Fake <code>kubectl</code> for the test environment</a></li>
<li><a href="#h-Implementation-for--Kube-lua---get-per-cluster-information">2.3.4. Implementation for <code>Kube.lua</code> (get per-cluster information)</a>
<ul>
<li><a href="#h-Fake-2">2.3.4.1. Fake</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#h-On-correctness">2.4. On correctness</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
NOTE: This manual is not yet ready for consumption. There are many missing
pieces (how to install, how to set up your configuration files, etc). Once the
main architecture settles down in the <a href="developer-manual.html">Developer Manual</a> this User Manual will be
revised accordingly.
</p>

<div id="outline-container-h-Concepts" class="outline-2">
<h2 id="h-Concepts"><span class="section-number-2">1.</span> Concepts</h2>
<div class="outline-text-2" id="text-h-Concepts">
<p>
Ultimately, you will want to provide <code>melbyc</code> with a Lua configuration file,
which will in turn provide it to <code>melbyd</code>. Most of your configuration will be
spent defining resources for the Standard Resource Service that <code>melbyd</code>
provides. This is because SRS generalizes the reading of data through shell
commands that would normally be run inside a shell script.
</p>
</div>

<div id="outline-container-h-Standard-Resource-Service--SRS" class="outline-3">
<h3 id="h-Standard-Resource-Service--SRS"><span class="section-number-3">1.1.</span> Standard Resource Service (SRS)</h3>
<div class="outline-text-3" id="text-h-Standard-Resource-Service--SRS">
<p>
Melby allows you to declaratively define a <b>resource</b> using the Standard
Resource Service. Each resource is a collection of shell commands that when
executed and parsed can create a single "object" of some sort, where the object
is a collection of key-value pairs (also known as a hashmap or dictionary). One
example could be a Git type that has various information about a particular Git
repo on disk at some path. Each object is associated with a type, and this
<b>type</b> information is called the <code>resource_type</code>.
</p>

<p>
Each resource also needs a way to distinguish itself against other resources of
the same type. The <code>resource_id</code> fulfills this role. For example, for the Git
resource type, the <code>resource_id</code> could be the unique path on disk for that Git
repo.
</p>
</div>
</div>
</div>

<div id="outline-container-h-Configuration-example" class="outline-2">
<h2 id="h-Configuration-example"><span class="section-number-2">2.</span> Configuration example</h2>
<div class="outline-text-2" id="text-h-Configuration-example">
<p>
Let's look at what a sample configuration might look like. The only requirement
is that we return a table (in this example, named <code>Config</code>) with a <code>view</code>
function. This function takes an <code>env</code> variable which is a table whose keys and
values reflect the environment variables that <code>melbyc</code> sees when it is invoked
by the user.
</p>
</div>
