user-manual.html

<div id="outline-container-h-Main-configuration" class="outline-3">
<h3 id="h-Main-configuration"><span class="section-number-3">2.1.</span> Main configuration</h3>
<div class="outline-text-3" id="text-h-Main-configuration">
<p>
We import the above into our main configuration, at <code>melby.lua</code>.
</p>

<p>
Note that we <code>require</code> the <code>Git</code>, <code>KubeCurrent</code>, and <code>Kube</code> packages.
This requires setting the <code>LUA_PATH</code> for melbyd when it starts up. Example:
</p>

<pre class="example" id="org0000000">
LUA_PATH="./?.lua;./?/init.lua;$PWD/test/sample/?.lua" make repl
</pre>

<p>
The question marks are replaced with the Lua module name. For Luerl, it uses
the LUA_PATH environment variable <a href="https://github.com/rvirding/luerl/blob/fc668ef337b04ca2aee83c648cf6853dab8babe6/src/luerl_lib_package.erl#L83">here</a>.
</p>

<p>
In our case, we should do 2 things:
</p>

<ol class="org-ol">
<li>in tests, make sure to set the LUA_PATH correctly (to the sample config
folder as above), and</li>
<li>in production, add the $HOME/.melby folder as a path.</li>
</ol>

<p>
Another option is to modify the package.path global variable like this:
</p>

<pre class="example" id="org0000001">
package.path = 'function/?.lua;' .. package.path
require "Git"
</pre>


<div class="org-src-container"><pre class="src src-lua" id="nil-1"><span class="org-comment-delimiter">-- </span><span class="org-comment">FIXME: Make LUA_PATH also include $HOME/.melby/?.lua.</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">FIXME: Make melbyc use the above path as a default if it's there, and only</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">overwrite it with the FILEPATH argument (move this FILEPATH argument to an</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">optional, not required, flag).</span>
<span class="org-keyword">local</span> <span class="org-variable-name">Git</span> = <span class="org-builtin">require</span> <span class="org-string">"Git"</span>
<span class="org-keyword">local</span> <span class="org-variable-name">KubeCurrent</span> = <span class="org-builtin">require</span> <span class="org-string">"KubeCurrent"</span>
<span class="org-keyword">local</span> <span class="org-variable-name">Kube</span> = <span class="org-builtin">require</span> <span class="org-string">"Kube"</span>

Config = {}
Config[<span class="org-string">"render_options"</span>] = {
  format = <span class="org-string">"RENDER_FORMAT_UNIX_TERMINAL"</span>,
  color_depth = <span class="org-string">"RENDER_COLOR_DEPTH_24_BIT"</span>
}

<span class="org-comment-delimiter">-- </span><span class="org-comment">This is required for both verification and reducing the inputs (env vars) to</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">a known subset.</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">FIXME: Also, strip the given env vars coming from melbyc down to only these</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">env vars. This forces the user to be explicity up-front (at this level)</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">exactly which env vars they expect to use.</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">FIXME: Require that these env vars are specified as keys for each element in</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">Config.validation's env_vars</span>
Config.view_params_types = {
  env={
    HOME                      = {<span class="org-string">"required"</span>, <span class="org-string">"path"</span>},
    HOST                      = {<span class="org-string">"required"</span>, <span class="org-string">"string"</span>},
    <span class="org-comment-delimiter">-- </span><span class="org-comment">"paths" means 1 or more colon-separated paths (no colons if only 1 path).</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">We don't need to bother with a real file on disk because we will never</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">actually read this path; for validation</span>
    KUBECONFIG                = {<span class="org-string">"required"</span>, <span class="org-string">"paths"</span>},
    MELBY_DIR                  = {<span class="org-string">"required"</span>, <span class="org-string">"path"</span>},
    MELBY_LAST_CMD_EXIT_STATUS = {<span class="org-string">"required"</span>, <span class="org-string">"int"</span>},
    <span class="org-comment-delimiter">-- </span><span class="org-comment">"pathblob" is like "path", except that it represents the *contents* of a</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">path. The filename is generated automatically using a temp folder plus</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">the name of the env var.</span>
    MELBY_PATH_ALIASES_FILE    = {<span class="org-string">"required"</span>, <span class="org-string">"pathblob"</span>},
    MELBY_TIME_ZONE            = {<span class="org-string">"optional"</span>, <span class="org-string">"string"</span>},
    MELBY_UNIX_SECONDS         = {<span class="org-string">"optional"</span>, <span class="org-string">"uint"</span>},
    MELBY_ZSH_KEYMAP_INDICATOR = {<span class="org-string">"required"</span>, <span class="org-string">"string"</span>},
    PWD                       = {<span class="org-string">"required"</span>, <span class="org-string">"path"</span>},
    USER                      = {<span class="org-string">"required"</span>, <span class="org-string">"string"</span>},
  },
  shell_pid                   = {<span class="org-string">"required"</span>, <span class="org-string">"uint"</span>}
}

<span class="org-comment-delimiter">-- </span><span class="org-comment">Return an array of array of env var overrides and substrings. For the</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">substrings, these are substrings that must be present in the output of the</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">Config.view() function.</span>
<span class="org-comment-delimiter">--</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">We have to override some env vars because otherwise they become polluted with</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">real paths that are coming from the actual melbyc invocation. For the</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">"preview" (fake) environment we want to control, ideally, all the env vars in</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">allowed_env_vars...!</span>
<span class="org-comment-delimiter">--</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">FIXME: Set all env vars in allowed_env_vars to make it deterministic. Also</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">probably set the shell_pid as well to make the function truly pure.</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">FIXME: rename env_var_overrides to something else because we're overriding</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">_every_ env var that matters to us.</span>
Config.view_tests = {
  <span class="org-comment-delimiter">-- </span><span class="org-comment">time_idx 0</span>
  {env={
    HOME                      = <span class="org-string">"/home/alice"</span>,
    HOST                      = <span class="org-string">"laptop"</span>,
    KUBECONFIG                = <span class="org-string">"/home/alice/.kube/config"</span>,
    <span class="org-comment-delimiter">-- </span><span class="org-comment">We don't actually need to have a real /home/alice/.melby folder with other</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">Lua files in it, because by the time this entire config is read, we</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">already parsed in all the Lua files we need. So this MELBY_DIR is really</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">just a placeholder.</span>
    MELBY_DIR                  = <span class="org-string">"/home/alice/.melby"</span>,
    MELBY_LAST_CMD_EXIT_STATUS = <span class="org-string">"0"</span>,
    <span class="org-comment-delimiter">-- </span><span class="org-comment">this is a "blobpath". the actual value here used in the env var will</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">point to a temporary filename which has the contents here.</span>
    MELBY_PATH_ALIASES_FILE    =
        <span class="org-string">[[</span>
<span class="org-string">            # Kubernetes.</span>
<span class="org-string">            hash -d   ki=${HOME}/go/src/github.com/kubernetes/k8s.io</span>
<span class="org-string">            hash -d   kk=${HOME}/go/src/k8s.io/kubernetes</span>
<span class="org-string">            hash -d   kr=${HOME}/go/src/k8s.io/release</span>
<span class="org-string">            hash -d   kt=${HOME}/go/src/k8s.io/test-infra</span>
<span class="org-string">            hash -d  cip=${HOME}/go/src/sigs.k8s.io/k8s-container-image-promoter</span>

<span class="org-string">            # Notes and dotfiles.</span>
<span class="org-string">            hash -d    l=${HOME}/lo</span>
<span class="org-string">            hash -d    s=${HOME}/syscfg</span>
<span class="org-string">        ]]</span>,
    MELBY_TIME_ZONE            = <span class="org-string">"America/Los_Angeles"</span>,
    MELBY_UNIX_SECONDS         = <span class="org-string">"1679032715"</span>,
    MELBY_ZSH_KEYMAP_INDICATOR = <span class="org-string">"I"</span>,
    PWD                       = <span class="org-string">"/repo/a"</span>,
    USER                      = <span class="org-string">"alice"</span>,
   },
  <span class="org-comment-delimiter">-- </span><span class="org-comment">FIXME: move shell_pid to an env_var to unify all inputs into env_vars.</span>
  shell_pid                   = <span class="org-string">"54311"</span>,
  expected_substrings={<span class="org-string">"K8s..."</span>, <span class="org-string">"Git..."</span>}},
}

<span class="org-keyword">function</span> <span class="org-function-name">Config.view</span> (<span class="org-variable-name">env</span>, <span class="org-variable-name">shell_pid</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">widgets_ps1_line1</span> = {}
  <span class="org-keyword">local</span> <span class="org-variable-name">widgets_ps1_line2</span> = {}
  <span class="org-comment-delimiter">-- </span><span class="org-comment">FIXME: We need a fake version of get_path_aliases as well, because we don't</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">want to actually read from disk, but let the user instead specify the</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">*contents* of such a file.</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">path_aliases</span> = melbyd.get_path_aliases(env[<span class="org-string">"MELBY_PATH_ALIASES_FILE"</span>])

  <span class="org-keyword">local</span> <span class="org-variable-name">pwd</span> = env[<span class="org-string">"PWD"</span>]
  <span class="org-keyword">local</span> <span class="org-variable-name">pwd_pretty_options</span> = {}
  <span class="org-comment-delimiter">-- </span><span class="org-comment">We try to fit under this length if possible.</span>
  pwd_pretty_options[<span class="org-string">"shorten_threshold"</span>] = 30
  pwd_pretty_options[<span class="org-string">"aliases"</span>] = path_aliases
  pwd_pretty_options[<span class="org-string">"env"</span>] = env
  <span class="org-comment-delimiter">-- </span><span class="org-comment">FIXME: Make melbyd.get_path_pretty return a LIST of strings that should be</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">joined with the path separator ("/"). Each element can have fields such as</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">color and type (whether it's a regular folder or symlink) as well as the</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">owner and permissions on it. For the first element (possibly an alias), we</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">can have a field to denote whether it's an alias. All of these bits of</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">information can be colorized a different way to give semantic coloring to</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">the final colorized path.</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">pwd_pretty_str</span> = melbyd.get_path_pretty(pwd, pwd_pretty_options)

  <span class="org-comment-delimiter">-- </span><span class="org-comment">Get the current time. In non-test-code, we can just call melbyd.get_time("%d</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">C %H:%M:%S %Z")</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">unix_seconds</span> = env[<span class="org-string">"MELBY_UNIX_SECONDS"</span>] <span class="org-keyword">or</span> melbyd.get_unix_seconds()
  <span class="org-keyword">local</span> <span class="org-variable-name">tz</span> = env[<span class="org-string">"MELBY_TIME_ZONE"</span>] <span class="org-keyword">or</span> <span class="org-string">"LOCAL"</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">time_day_name</span> = melbyd.get_time(<span class="org-string">"%a"</span>, unix_seconds, tz)
  <span class="org-keyword">local</span> <span class="org-variable-name">day_in_kanji</span> = {}
  day_in_kanji[<span class="org-string">"Mon"</span>] = <span class="org-builtin">utf8</span>.<span class="org-builtin">char</span>(0x6708) <span class="org-comment-delimiter">-- </span><span class="org-comment">"&#26376;"</span>
  day_in_kanji[<span class="org-string">"Tue"</span>] = <span class="org-builtin">utf8</span>.<span class="org-builtin">char</span>(0x706b) <span class="org-comment-delimiter">-- </span><span class="org-comment">"&#28779;"</span>
  day_in_kanji[<span class="org-string">"Wed"</span>] = <span class="org-builtin">utf8</span>.<span class="org-builtin">char</span>(0x6c34) <span class="org-comment-delimiter">-- </span><span class="org-comment">"&#27700;"</span>
  day_in_kanji[<span class="org-string">"Thu"</span>] = <span class="org-builtin">utf8</span>.<span class="org-builtin">char</span>(0x6728) <span class="org-comment-delimiter">-- </span><span class="org-comment">"&#26408;"</span>
  day_in_kanji[<span class="org-string">"Fri"</span>] = <span class="org-builtin">utf8</span>.<span class="org-builtin">char</span>(0x91d1) <span class="org-comment-delimiter">-- </span><span class="org-comment">"&#37329;"</span>
  day_in_kanji[<span class="org-string">"Sat"</span>] = <span class="org-builtin">utf8</span>.<span class="org-builtin">char</span>(0x571f) <span class="org-comment-delimiter">-- </span><span class="org-comment">"&#22303;"</span>
  day_in_kanji[<span class="org-string">"Sun"</span>] = <span class="org-builtin">utf8</span>.<span class="org-builtin">char</span>(0x65e5) <span class="org-comment-delimiter">-- </span><span class="org-comment">"&#26085;"</span>

  <span class="org-keyword">local</span> <span class="org-variable-name">time_day_name_kanji</span> = day_in_kanji[time_day_name]
  <span class="org-keyword">local</span> <span class="org-variable-name">time_str</span> = melbyd.get_time(<span class="org-string">" %m-%d "</span> .. time_day_name_kanji ..
                                   <span class="org-string">" %H:%M:%S %Z "</span>, unix_seconds, tz)
  <span class="org-keyword">local</span> <span class="org-variable-name">time</span> = {str=time_str, fg=<span class="org-string">"black"</span>, bg=<span class="org-string">"gold"</span>, styles={<span class="org-string">"bold"</span>}}
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets_ps1_line1, time)

  <span class="org-keyword">local</span> <span class="org-variable-name">time_utc_day_name</span> = melbyd.get_time(<span class="org-string">"%a"</span>, env[<span class="org-string">"MELBY_UNIX_SECONDS"</span>],
                                            <span class="org-string">"Etc/UTC"</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">time_utc_day_name_kanji</span> = day_in_kanji[time_utc_day_name]
  <span class="org-keyword">local</span> <span class="org-variable-name">time_utc_str</span> = melbyd.get_time(<span class="org-string">" %m-%d "</span> .. time_utc_day_name_kanji ..
                                       <span class="org-string">" %H:%M:%S %Z "</span>, unix_seconds, <span class="org-string">"Etc/UTC"</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">time_utc</span> = {str=time_utc_str, fg=<span class="org-string">"black"</span>, bg=<span class="org-string">"pink"</span>, styles={<span class="org-string">"bold"</span>}}
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets_ps1_line1, time_utc)

  <span class="org-keyword">local</span> <span class="org-variable-name">zki_str</span> = env[<span class="org-string">"MELBY_ZSH_KEYMAP_INDICATOR"</span>] <span class="org-keyword">or</span> <span class="org-string">"I"</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">zki</span> = {str=<span class="org-string">" &lt;"</span> .. zki_str .. <span class="org-string">"&gt; "</span>, fg=<span class="org-string">"white"</span>, styles={<span class="org-string">"bold"</span>}}
  <span class="org-keyword">if</span> zki_str == <span class="org-string">"N"</span> <span class="org-keyword">then</span>
    zki.fg = <span class="org-string">"black"</span>
    zki.bg = <span class="org-string">"lightskyblue"</span>
  <span class="org-keyword">end</span>
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets_ps1_line1, zki)

  <span class="org-keyword">local</span> <span class="org-variable-name">last_command_exit_status_str</span> = env[<span class="org-string">"MELBY_LAST_CMD_EXIT_STATUS"</span>] <span class="org-keyword">or</span> <span class="org-string">""</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">last_command_exit_status</span> = {str=<span class="org-string">" "</span> .. last_command_exit_status_str .. <span class="org-string">" "</span>,
                                    fg=<span class="org-string">"black"</span>, bg=<span class="org-string">"red"</span>, styles={<span class="org-string">"bold"</span>}}
  <span class="org-keyword">if</span> #last_command_exit_status_str &gt; 0 <span class="org-keyword">and</span> last_command_exit_status_str ~= <span class="org-string">"0"</span> <span class="org-keyword">then</span>
    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets_ps1_line1, last_command_exit_status)
  <span class="org-keyword">end</span>

  <span class="org-comment-delimiter">-- </span><span class="org-comment">Create a one-shot message for testing (when we want to publish an ad-hoc</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">message).</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">--</span><span class="org-comment">local message = {topic="srs_Git", from="/home/l/prog/melby", payload={level="info", text="Hello world"}}</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">--</span><span class="org-comment">melbyd.broadcast("srs_Git", message)</span>

  user = env[<span class="org-string">"USER"</span>] <span class="org-keyword">or</span> <span class="org-string">"user"</span>
  host = env[<span class="org-string">"HOST"</span>] <span class="org-keyword">or</span> <span class="org-string">"host"</span>
  user_host = {str=(user .. <span class="org-string">"@"</span> .. host)}
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets_ps1_line1, user_host)

  pwd_pretty = {str=pwd_pretty_str, fg=<span class="org-string">"cyan"</span>, styles={<span class="org-string">"bold"</span>}}
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets_ps1_line1, pwd_pretty)

  <span class="org-comment-delimiter">-- </span><span class="org-comment">FIXME: Run Kube.read() for every Kubernetes context found in the set of</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">MELBY_KUBE_CONTEXTS.</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">get_kube_contexts(env["MELBY_KUBE_CONTEXTS"])</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">example: "ctx1,ctx2,ctx3"</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">FIXME: Need to loop this around multiple context:namespace combos, probably</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">encoded in MELBY_KUBE_CONTEXTS</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">--</span><span class="org-comment">local kube_standard_resource = Kube:read("kind-kind-prow-integration",</span>
  <span class="org-comment-delimiter">--</span><span class="org-comment">"default", env["MELBY_DIR"])</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">--</span><span class="org-comment">local kube_widgets = Kube.view(kube_standard_resource)</span>
  <span class="org-comment-delimiter">--</span><span class="org-comment">for _, w in ipairs(kube_widgets) do</span>
  <span class="org-comment-delimiter">--  </span><span class="org-comment">table.insert(widgets_ps1_line2, w)</span>
  <span class="org-comment-delimiter">--</span><span class="org-comment">end</span>

  <span class="org-keyword">local</span> <span class="org-variable-name">kubecurrent_standard_resource</span> = KubeCurrent:read(env,
                                                         {<span class="org-string">"KUBECONFIG"</span>, <span class="org-string">"HOME"</span>})
  <span class="org-keyword">local</span> <span class="org-variable-name">health_resource</span> = {}
  <span class="org-keyword">local</span> <span class="org-variable-name">health_resource_status</span> = <span class="org-string">""</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">health_widgets</span> = {}
  <span class="org-keyword">local</span> <span class="org-variable-name">health_str</span> = <span class="org-string">""</span>
  <span class="org-keyword">if</span> kubecurrent_standard_resource.status ==
       <span class="org-string">"STANDARD_RESOURCE_STATUS_LOADED"</span> <span class="org-keyword">then</span>
    health_resource = Kube:read(kubecurrent_standard_resource.kvs.context,
                                kubecurrent_standard_resource.kvs.namespace,
                                env[<span class="org-string">"MELBY_DIR"</span>])
    health_resource_status = health_resource.status
    health_widgets = Kube.view(health_resource)
    health_str = melbyd.render(health_widgets, {str=<span class="org-string">" "</span>})
  <span class="org-keyword">end</span>

  <span class="org-keyword">local</span> <span class="org-variable-name">kubecurrent_widgets</span> = KubeCurrent.view(kubecurrent_standard_resource,
                                               health_resource.status,
                                               health_str)
  <span class="org-keyword">for</span> <span class="org-variable-name">_</span>, <span class="org-variable-name">w</span> <span class="org-keyword">in</span> <span class="org-builtin">ipairs</span>(kubecurrent_widgets) <span class="org-keyword">do</span>
    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets_ps1_line2, w)
  <span class="org-keyword">end</span>

  <span class="org-comment-delimiter">-- </span><span class="org-comment">Note that because Git:read() returns very quickly (we designed the backend</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">to be asynchronous), we don't need to worry about parallelism at the Lua</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">configuration level.</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Get git information for PWD, if any. We use "MELBY_DIR" so that we can use</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">it in the Git.readers() function for calling custom scripts at custom</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">locations (wherever MELBY_DIR points to).</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">git_standard_resource</span> = Git:read(env, {<span class="org-string">"PWD"</span>, <span class="org-string">"MELBY_DIR"</span>})
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Use the standard widgets that come with the "Git.lua" module.</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">git_widgets</span> = Git.view(git_standard_resource)
  <span class="org-keyword">for</span> <span class="org-variable-name">_</span>, <span class="org-variable-name">w</span> <span class="org-keyword">in</span> <span class="org-builtin">ipairs</span>(git_widgets) <span class="org-keyword">do</span>
    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets_ps1_line2, w)
  <span class="org-keyword">end</span>

  <span class="org-comment-delimiter">-- </span><span class="org-comment">Render widgets. Some go into line 1, others into line 2.</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">ps1_line1</span> = melbyd.render(widgets_ps1_line1, {str=<span class="org-string">" "</span>})
  <span class="org-keyword">local</span> <span class="org-variable-name">ps1_line2</span> = melbyd.render(widgets_ps1_line2, {str=<span class="org-string">" "</span>})

  <span class="org-comment-delimiter">-- </span><span class="org-comment">We need to get messages first because we need to subscribe first. Otherwise</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Git SRS will start first and we'll miss its first broadcast (how long the</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">initial read took).</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">messages</span> = melbyd.get_shell_messages(shell_pid,
                                            {Git, KubeCurrent},
                                            {PWD=env[<span class="org-string">"PWD"</span>],
                                             KUBECONFIG=(env[<span class="org-string">"KUBECONFIG"</span>] <span class="org-keyword">or</span> <span class="org-string">""</span>)})
  <span class="org-keyword">local</span> <span class="org-variable-name">message_strs</span> = {}
  <span class="org-keyword">for</span> <span class="org-variable-name">_</span>, <span class="org-variable-name">message</span> <span class="org-keyword">in</span> <span class="org-builtin">ipairs</span>(messages) <span class="org-keyword">do</span>
    <span class="org-keyword">if</span> message[<span class="org-string">"topic"</span>] == <span class="org-string">"srs_Git"</span> <span class="org-keyword">then</span>
      message_str = Git.message_to_string(message, pwd_pretty_options)
    <span class="org-keyword">elseif</span> message[<span class="org-string">"topic"</span>] == <span class="org-string">"srs_KubeCurrent"</span> <span class="org-keyword">then</span>
      message_str = KubeCurrent.message_to_string(message)
    <span class="org-keyword">end</span>
    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(message_strs, message_str .. <span class="org-string">"\n"</span>)
  <span class="org-keyword">end</span>

  <span class="org-comment-delimiter">-- </span><span class="org-comment">Create a dictionary of shell variables to create.</span>
  export = {}
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(export, {name=<span class="org-string">"MELBY_PS1_LINE1"</span>, val=ps1_line1, <span class="org-builtin">type</span>=<span class="org-string">"string"</span>})
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(export, {name=<span class="org-string">"MELBY_PS1_LINE2"</span>, val=ps1_line2, <span class="org-builtin">type</span>=<span class="org-string">"string"</span>})
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(export, {name=<span class="org-string">"MELBY_SHELL_MESSAGES"</span>, val=message_strs,
                        <span class="org-builtin">type</span>=<span class="org-string">"array"</span>})

  <span class="org-comment-delimiter">-- </span><span class="org-comment">Create a shell script that instantiates the exported variables.</span>
  script = melbyd.to_shell_script(export)
  <span class="org-keyword">return</span> script
<span class="org-keyword">end</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">This line is to force evaluation of these loaded modules by Luerl, such that</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">they show up in the loaded vm state.</span>
<span class="org-keyword">return</span> {g = Git, kc = KubeCurrent, k = Kube}
</pre></div>
</div>
</div>
