user-manual.html

<div id="outline-container-h-Git-resource" class="outline-3">
<h3 id="h-Git-resource"><span class="section-number-3">2.2.</span> Git resource</h3>
<div class="outline-text-3" id="text-h-Git-resource">
<p>
FIXME: break this up into multiple chunks for smaller bits of explanation
(prefer to maximize prose comments here instead of comments in the Lua code).
</p>

<div class="org-src-container"><pre class="src src-lua" id="nil-2"><span class="org-comment-delimiter">-- </span><span class="org-comment">Git Lua module for melby.</span>
<span class="org-keyword">local</span> <span class="org-variable-name">Git</span> = {}
Git[<span class="org-string">"type"</span>] = <span class="org-string">"Git"</span>
Git[<span class="org-string">"history_size"</span>] = 10
Git[<span class="org-string">"parser"</span>] = {}
Git[<span class="org-string">"fake"</span>] = <span class="org-builtin">require</span> <span class="org-string">"GitFake"</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">Read the state of the world for this Git repo. Relies on Git.model.readers to</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">get the job done.</span>
<span class="org-keyword">function</span> <span class="org-function-name">Git.read</span> (<span class="org-builtin">self</span>, <span class="org-variable-name">env</span>, <span class="org-variable-name">var_names</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">resource_opts</span> = {}
  <span class="org-keyword">for</span> <span class="org-variable-name">_</span>, <span class="org-variable-name">var_name</span> <span class="org-keyword">in</span> <span class="org-builtin">ipairs</span>(var_names) <span class="org-keyword">do</span>
    resource_opts[var_name] = env[var_name]
  <span class="org-keyword">end</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Gets the current state of the SRS GenServer's latest "head" of this</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">resource. This is because this resource can have a number of states stored</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">in its history (and here we retrieve the first one). Also note that this</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">call is very cheap because sometimes we will just read the already-stored</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">history item (that is, calling this function may or may not result in</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">running the Git.model.readers() commands).</span>
  <span class="org-keyword">return</span> melbyd.read_standard_resource(<span class="org-builtin">self</span>, resource_opts)
<span class="org-keyword">end</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">Used to generate a unique resource_id. E.g., for Git, this is the absolute</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">folder path of the git root folder. This is because for Git, clients can</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">legitimately ask questions about the Git repo as long as they are in a child</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">folder under the root. Other resources that are filesystem-based will likely</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">be the same (e.g., direnv).</span>
<span class="org-keyword">function</span> <span class="org-function-name">Git.resource_id_command</span> (<span class="org-variable-name">resource_opts</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">pwd</span> = resource_opts[<span class="org-string">"PWD"</span>]
  <span class="org-keyword">return</span> {cd=pwd, invocation={<span class="org-string">"git"</span>, <span class="org-string">"rev-parse"</span>, <span class="org-string">"--show-toplevel"</span>}}
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">Git.readers</span> (<span class="org-variable-name">resource_opts</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">pwd</span> = resource_opts[<span class="org-string">"PWD"</span>]
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Each reader needs an associated parser. The parser function is just the</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">string name of a Git.parser.* function name. So parser="diff" refers to</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Git.parser.diff().</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">FIXME: Move the invocation definition to a function, and put this function</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">next to each parser function.</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">readers</span> = {
    {cd=pwd, invocation={<span class="org-string">"git"</span>, <span class="org-string">"diff"</span>, <span class="org-string">"--shortstat"</span>},
     parser=<span class="org-string">"diff"</span>},

    {cd=pwd, invocation={<span class="org-string">"git"</span>, <span class="org-string">"diff"</span>, <span class="org-string">"--shortstat"</span>, <span class="org-string">"--cached"</span>},
     parser=<span class="org-string">"diff_cached"</span>},

    {cd=pwd, invocation={<span class="org-string">"git"</span>, <span class="org-string">"diff"</span>, <span class="org-string">"--numstat"</span>},
     parser=<span class="org-string">"diff_binary"</span>},

    {cd=pwd, invocation={<span class="org-string">"git"</span>, <span class="org-string">"diff"</span>, <span class="org-string">"--numstat"</span>, <span class="org-string">"--cached"</span>},
     parser=<span class="org-string">"diff_cached_binary"</span>},

    {cd=pwd, invocation={(resource_opts[<span class="org-string">"MELBY_DIR"</span>] <span class="org-keyword">or</span> <span class="org-string">""</span>) ..
         <span class="org-string">"/git_staged_bytes.sh"</span>, <span class="org-string">"quiet"</span>},
     parser=<span class="org-string">"staged_bytes"</span>},

    {cd=pwd, invocation={<span class="org-string">"git"</span>, <span class="org-string">"log"</span>, <span class="org-string">"--no-walk"</span>,
                         <span class="org-string">"--format=head_author_date,%at%n"</span> ..
                           <span class="org-string">"head_author_name,%an%n"</span> ..
                           <span class="org-string">"head_committer_date,%ct%n"</span> ..
                           <span class="org-string">"head_committer_name,%cn"</span>,
                         <span class="org-string">"HEAD"</span>},
     parser=<span class="org-string">"head_metadata"</span>},

    {cd=pwd, invocation={<span class="org-string">"git"</span>, <span class="org-string">"ls-files"</span>, <span class="org-string">"--others"</span>, <span class="org-string">"--exclude-standard"</span>},
     parser=<span class="org-string">"untracked_files"</span>},

    {cd=pwd, invocation={<span class="org-string">"git"</span>, <span class="org-string">"ls-files"</span>, <span class="org-string">"-v"</span>},
     parser=<span class="org-string">"assume_unchanged_files"</span>},

    {cd=pwd, invocation={<span class="org-string">"git"</span>, <span class="org-string">"rev-list"</span>, <span class="org-string">"--left-right"</span>, <span class="org-string">"--count"</span>,
                         <span class="org-string">"HEAD...@{upstream}"</span>},
     parser=<span class="org-string">"count_head_vs_upstream"</span>},

    {cd=pwd, invocation={<span class="org-string">"git"</span>, <span class="org-string">"rev-parse"</span>, <span class="org-string">"--abbrev-ref"</span>, <span class="org-string">"HEAD"</span>},
     parser=<span class="org-string">"head_branch"</span>},

    {cd=pwd, invocation={<span class="org-string">"git"</span>, <span class="org-string">"rev-parse"</span>, <span class="org-string">"HEAD"</span>},
     parser=<span class="org-string">"head_sha"</span>},

    {cd=pwd, invocation={<span class="org-string">"git"</span>, <span class="org-string">"rev-parse"</span>, <span class="org-string">"--is-bare-repository"</span>},
     parser=<span class="org-string">"bare"</span>},

    {cd=pwd, invocation={<span class="org-string">"git"</span>, <span class="org-string">"stash"</span>, <span class="org-string">"list"</span>},
     parser=<span class="org-string">"stash_size"</span>},

    {cd=pwd, invocation={<span class="org-string">"git"</span>, <span class="org-string">"submodule"</span>, <span class="org-string">"status"</span>},
     parser=<span class="org-string">"submodule_status"</span>},
  }
  <span class="org-keyword">return</span> readers
<span class="org-keyword">end</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">Staleness flaggers are objects that mark staleness. A stale resource is</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">refreshed (by re-reading the state of the world). Here we define a</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">filesystem-based staleness flagger which marks the model as stale, based on a</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">simple algorithm that ignores changes to Git index files (these files are</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">modified by the "git" binary).</span>
<span class="org-keyword">function</span> <span class="org-function-name">Git.staleness_flaggers</span> (<span class="org-variable-name">resource_id</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">repo_root</span> = resource_id
  <span class="org-keyword">local</span> <span class="org-variable-name">filesystem</span> = {}
  filesystem[<span class="org-string">"type"</span>] = <span class="org-string">"filesystem"</span>
  filesystem[<span class="org-string">"watch_paths"</span>] = {repo_root}

  <span class="org-comment-delimiter">-- </span><span class="org-comment">Custom logic to check how to detect cache invalidation, and whether to also</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">invalidate all parent SRS GenServers up along the path (if any).</span>
  filesystem[<span class="org-string">"fs_event_handler"</span>] = <span class="org-keyword">function</span> (<span class="org-variable-name">path</span>, <span class="org-variable-name">events</span>)
    <span class="org-comment-delimiter">-- </span><span class="org-comment">For index files (".git/**/index.lock"), ignore all events except just</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">":modified".</span>
    <span class="org-comment-delimiter">--</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">When we do get a :modified event, this can happen</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">if HEAD moves, which is important when we (for example) modify the</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">HEAD of submodules.</span>
    <span class="org-keyword">if</span> <span class="org-builtin">string</span>.<span class="org-builtin">find</span>(path, <span class="org-string">"/.git/"</span>) <span class="org-keyword">and</span> <span class="org-builtin">string</span>.<span class="org-builtin">find</span>(path, <span class="org-string">"/index.lock$"</span>) <span class="org-keyword">then</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">FIXME note: Looks like</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">https://github.com/rvirding/luerl/blob/5e61c1838d08430af67fb870995b05a41d64aeee/src/luerl.erl#L340</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">converts an atom into a "binary" (string). This just drops the initial</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">":" and makes the rest a string as is.</span>
      <span class="org-keyword">if</span> #events == 1 <span class="org-keyword">and</span> events[1] == <span class="org-string">"modified"</span> <span class="org-keyword">then</span>
        <span class="org-keyword">return</span> <span class="org-constant">true</span>
      <span class="org-keyword">else</span>
        <span class="org-comment-delimiter">-- </span><span class="org-comment">For index files, ignore all other events such as [:modified, :closed]</span>
        <span class="org-comment-delimiter">-- </span><span class="org-comment">which can also happen with [:created] and [:deleted] whenever we</span>
        <span class="org-comment-delimiter">-- </span><span class="org-comment">invoke certain Git read-only operations (e.g., git status).</span>
        <span class="org-keyword">return</span> <span class="org-constant">false</span>
      <span class="org-keyword">end</span>
    <span class="org-keyword">end</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">NOTE: Conceivably, if we're using jj, we could also ignore any changes</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">going into the "/.jj/" folder.</span>
    <span class="org-keyword">return</span> <span class="org-constant">true</span>
  <span class="org-keyword">end</span>

  <span class="org-comment-delimiter">-- </span><span class="org-comment">We can technically have multiple staleness flaggers, although there can be</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">only 1 filesystem one (because all filesystem events are fed to the</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">fs_event_handler above).</span>
  <span class="org-keyword">return</span> {filesystem}
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">Git.parser.diff</span> (<span class="org-variable-name">s</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">ret</span> = {}
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Example input strings:</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">" 1 file changed, 32 insertions(+), 2 deletions(-)"</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">" 1 file changed, 35 insertions(+)"</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">" 1 file changed, 8 deletions(-)"</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Note that the "unstaged_files" here does include changed binary files.</span>
  ret[<span class="org-string">"unstaged_files"</span>] = melbyd.get_int_group(s, <span class="org-string">"(\\d+) fil"</span>)
  ret[<span class="org-string">"unstaged_insertions"</span>] = melbyd.get_int_group(s, <span class="org-string">"(\\d+) ins"</span>)
  ret[<span class="org-string">"unstaged_deletions"</span>] = melbyd.get_int_group(s, <span class="org-string">"(\\d+) del"</span>)

  <span class="org-keyword">return</span> ret
<span class="org-keyword">end</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">Same as Git.parser.diff, but with slightly different keys.</span>
<span class="org-keyword">function</span> <span class="org-function-name">Git.parser.diff_cached</span> (<span class="org-variable-name">s</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">ret</span> = {}
  ret[<span class="org-string">"staged_files"</span>] = melbyd.get_int_group(s, <span class="org-string">"(\\d+) fil"</span>)
  ret[<span class="org-string">"staged_insertions"</span>] = melbyd.get_int_group(s, <span class="org-string">"(\\d+) ins"</span>)
  ret[<span class="org-string">"staged_deletions"</span>] = melbyd.get_int_group(s, <span class="org-string">"(\\d+) del"</span>)

  <span class="org-keyword">return</span> ret
<span class="org-keyword">end</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">Only count binary files that have changed. Simply count the number of lines</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">that start with "-".</span>
<span class="org-keyword">function</span> <span class="org-function-name">Git.parser.diff_binary</span> (<span class="org-variable-name">s</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">ret</span> = {}
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Example input:</span>
  <span class="org-comment-delimiter">--    </span><span class="org-comment">5   1   doc/build-literate.org</span>
  <span class="org-comment-delimiter">--    </span><span class="org-comment">-   -   doc/melby.html</span>

  ret[<span class="org-string">"unstaged_files_binary"</span>] = melbyd.get_lines_matching_count(s, <span class="org-string">"-"</span>)

  <span class="org-keyword">return</span> melbyd.cast_values(ret, {unstaged_files_binary=<span class="org-string">"int"</span>})
<span class="org-keyword">end</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">Same as Git.parser.diff, but with slightly different keys.</span>
<span class="org-keyword">function</span> <span class="org-function-name">Git.parser.diff_cached_binary</span> (<span class="org-variable-name">s</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">ret</span> = {}
  ret[<span class="org-string">"staged_files_binary"</span>] = melbyd.get_lines_matching_count(s, <span class="org-string">"-"</span>)

  <span class="org-keyword">return</span> melbyd.cast_values(ret, {staged_files_binary=<span class="org-string">"int"</span>})
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">Git.parser.untracked_files</span> (<span class="org-variable-name">s</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">ret</span> = {}

  <span class="org-keyword">local</span> <span class="org-variable-name">lines</span> = melbyd.get_lines_trimmed_nonempty(s)
  ret[<span class="org-string">"untracked_files"</span>] = #lines

  <span class="org-keyword">return</span> ret
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">Git.parser.submodule_status</span> (<span class="org-variable-name">s</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">ret</span> = {}

  <span class="org-keyword">local</span> <span class="org-variable-name">lines</span> = melbyd.get_lines_trimmed_nonempty(s)

  <span class="org-keyword">local</span> <span class="org-variable-name">uninitialzed</span> = 0
  <span class="org-keyword">local</span> <span class="org-variable-name">out_of_sync</span> = 0
  <span class="org-keyword">local</span> <span class="org-variable-name">merge_conflicts</span> = 0

  <span class="org-keyword">for</span> <span class="org-variable-name">i</span>=1,#lines <span class="org-keyword">do</span>
    <span class="org-keyword">local</span> <span class="org-variable-name">c</span> = <span class="org-builtin">string</span>.<span class="org-builtin">sub</span>(lines[i], 1, 1)
    <span class="org-keyword">if</span> c == <span class="org-string">"-"</span> <span class="org-keyword">then</span>
      uninitialzed = uninitialzed + 1
    <span class="org-keyword">elseif</span> c == <span class="org-string">"+"</span> <span class="org-keyword">then</span>
      out_of_sync = out_of_sync + 1
    <span class="org-keyword">elseif</span> c == <span class="org-string">"U"</span> <span class="org-keyword">then</span>
      merge_conflicts = merge_conflicts + 1
    <span class="org-keyword">end</span>
  <span class="org-keyword">end</span>

  ret[<span class="org-string">"submodule_uninitialized"</span>] = uninitialzed
  ret[<span class="org-string">"submodule_out_of_sync"</span>] = out_of_sync
  ret[<span class="org-string">"submodule_merge_conflicts"</span>] = merge_conflicts

  <span class="org-keyword">return</span> ret
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">Git.parser.head_branch</span> (<span class="org-variable-name">s</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">ret</span> = {}

  <span class="org-comment-delimiter">-- </span><span class="org-comment">This is "HEAD" if we are in detached HEAD state.</span>
  ret[<span class="org-string">"head_branch"</span>] = melbyd.get_trimmed(s)

  <span class="org-keyword">return</span> ret
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">Git.parser.head_sha</span> (<span class="org-variable-name">s</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">ret</span> = {}

  ret[<span class="org-string">"head_sha"</span>] = melbyd.get_trimmed(s)

  <span class="org-keyword">return</span> ret
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">Git.parser.bare</span> (<span class="org-variable-name">s</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">ret</span> = {}

  ret[<span class="org-string">"bare"</span>] = melbyd.get_trimmed(s)

  <span class="org-keyword">return</span> melbyd.cast_values(ret, {bare=<span class="org-string">"bool"</span>})
<span class="org-keyword">end</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">This function can fail even inside a normal Git repo (with "fatal: no</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">upstream configured for branch 'BRANCH_NAME").</span>
<span class="org-keyword">function</span> <span class="org-function-name">Git.parser.count_head_vs_upstream</span> (<span class="org-variable-name">s</span>)
  <span class="org-keyword">if</span> #s == 0 <span class="org-keyword">then</span>
    <span class="org-keyword">return</span> {count_upstream_to_head=0, count_head_to_upstream=0}
  <span class="org-keyword">end</span>

  ret = melbyd.get_columnar_fields_zipped(s,
                                         {<span class="org-string">"count_upstream_to_head"</span>,
                                          <span class="org-string">"count_head_to_upstream"</span>})

  <span class="org-keyword">return</span> melbyd.cast_values(ret, {count_upstream_to_head=<span class="org-string">"int"</span>,
                                 count_head_to_upstream=<span class="org-string">"int"</span>})
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">Git.parser.stash_size</span> (<span class="org-variable-name">s</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">ret</span> = {}

  <span class="org-keyword">local</span> <span class="org-variable-name">lines</span> = melbyd.get_lines_trimmed_nonempty(s)
  ret[<span class="org-string">"stash_size"</span>] = #lines

  <span class="org-keyword">return</span> ret
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">Git.parser.staged_bytes</span> (<span class="org-variable-name">s</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">ret</span> = {}

  <span class="org-keyword">if</span> #s &gt; 0 <span class="org-keyword">then</span>
    ret[<span class="org-string">"staged_bytes"</span>] = <span class="org-builtin">tonumber</span>(s)
  <span class="org-keyword">else</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">This can happen if the command failed (generated an empty string).</span>
    ret[<span class="org-string">"staged_bytes"</span>] = 0
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> melbyd.cast_values(ret, {staged_bytes=<span class="org-string">"int"</span>})
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">Git.parser.assume_unchanged_files</span> (<span class="org-variable-name">s</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">ret</span> = {}

  <span class="org-keyword">local</span> <span class="org-variable-name">lines</span> = melbyd.get_lines_trimmed_nonempty(s)

  <span class="org-keyword">local</span> <span class="org-variable-name">count</span> = 0

  <span class="org-keyword">for</span> <span class="org-variable-name">i</span>=1,#lines <span class="org-keyword">do</span>
    <span class="org-keyword">local</span> <span class="org-variable-name">ascii_num</span> = <span class="org-builtin">string</span>.<span class="org-builtin">byte</span>(<span class="org-builtin">string</span>.<span class="org-builtin">sub</span>(lines[i], 1, 1))
    <span class="org-comment-delimiter">-- </span><span class="org-comment">According to git-ls-files(1), the "-v" flag marks assume-unchanged files</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">with a leading lowercase letter.</span>
    <span class="org-keyword">if</span> 0x61 &lt;= ascii_num <span class="org-keyword">and</span> ascii_num &lt;= 0x7a <span class="org-keyword">then</span>
      count = count + 1
    <span class="org-keyword">end</span>
  <span class="org-keyword">end</span>

  ret[<span class="org-string">"assume_unchanged_files"</span>] = count

  <span class="org-keyword">return</span> ret
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">Git.parser.head_metadata</span> (<span class="org-variable-name">s</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">ret</span> = {}
  ret = melbyd.get_kv_lines_as_map(s)
  <span class="org-keyword">return</span> melbyd.cast_values(ret, {head_author_date=<span class="org-string">"int"</span>,
                                 head_committer_date=<span class="org-string">"int"</span>})
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">Git.notify</span> (<span class="org-variable-name">resource_id</span>, <span class="org-variable-name">old</span>, <span class="org-variable-name">new</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">repo_root</span> = resource_id
  <span class="org-keyword">local</span> <span class="org-variable-name">message</span> = {}
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Look at overall state of the old resource versus the new resource. Generate</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">messages for interesting state changes.</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">This is where we need to warn users about linting errors and such.</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">FIXME: If this is a "Rust" codebase, we could have a "Rust" model that</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">performs linter and formatter checks.</span>

  <span class="org-comment-delimiter">-- </span><span class="org-comment">If we stage or unstage something, show tentative "commit size".</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">old_staged_bytes</span> = old.kvs.staged_bytes
  <span class="org-keyword">local</span> <span class="org-variable-name">new_staged_bytes</span> = new.kvs.staged_bytes
  melbyd.log(<span class="org-string">"old_staged_bytes: "</span> .. old_staged_bytes)
  melbyd.log(<span class="org-string">"new_staged_bytes: "</span> .. new_staged_bytes)
  <span class="org-keyword">if</span> new_staged_bytes ~= old_staged_bytes <span class="org-keyword">then</span>
    <span class="org-keyword">local</span> <span class="org-variable-name">size_rating</span> = <span class="org-string">""</span>

    <span class="org-comment-delimiter">-- </span><span class="org-comment">The sizes here are taken from the following geometric series:</span>
    <span class="org-comment-delimiter">--</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">ghci&gt; map (\x -&gt; round $ 2.718281828^x) [1..10]</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">[3,7,20,55,148,403,1097,2981,8103,22026]</span>

    <span class="org-keyword">if</span> new_staged_bytes &lt; 55 <span class="org-keyword">then</span>
      size_rating = <span class="org-string">"XS"</span>
    <span class="org-keyword">elseif</span> new_staged_bytes &lt; 148 <span class="org-keyword">then</span>
      size_rating = <span class="org-string">"S"</span>
    <span class="org-keyword">elseif</span> new_staged_bytes &lt; 403 <span class="org-keyword">then</span>
      size_rating = <span class="org-string">"M"</span>
    <span class="org-keyword">elseif</span> new_staged_bytes &lt; 1097 <span class="org-keyword">then</span>
      size_rating = <span class="org-string">"L"</span>
    <span class="org-keyword">elseif</span> new_staged_bytes &lt; 2981 <span class="org-keyword">then</span>
      size_rating = <span class="org-string">"XL"</span>
    <span class="org-keyword">else</span>
      size_rating = <span class="org-string">"XXL"</span>
    <span class="org-keyword">end</span>
    message[<span class="org-string">"topic"</span>]=<span class="org-string">"srs_Git"</span>
    message[<span class="org-string">"from"</span>]=repo_root

    <span class="org-keyword">if</span> new_staged_bytes == 0 <span class="org-keyword">then</span>
      message[<span class="org-string">"payload"</span>]={level=<span class="org-string">"info"</span>,
                          text=<span class="org-string">"Staging area is now empty (nothing to commit)."</span>}
    <span class="org-keyword">else</span>
      message[<span class="org-string">"payload"</span>]={level=<span class="org-string">"info"</span>,
                          text=<span class="org-string">"Staged size is now "</span> .. size_rating ..
                            <span class="org-string">" ("</span> .. new_staged_bytes .. <span class="org-string">" bytes)."</span>}
    <span class="org-keyword">end</span>
    melbyd.broadcast(<span class="org-string">"srs_Git"</span>, message)
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> <span class="org-constant">nil</span>
<span class="org-keyword">end</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">For a ShellLogger that is receiving a message from us (Git resource), only</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">keep messages where the repo path is a prefix of the shell's pwd. To keep the</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">message, return true.</span>
<span class="org-keyword">function</span> <span class="org-function-name">Git.should_keep_message</span> (<span class="org-variable-name">message</span>, <span class="org-variable-name">env_vars</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">pwd</span> = env_vars[<span class="org-string">"PWD"</span>]
  <span class="org-keyword">local</span> <span class="org-variable-name">i</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">repo_path</span> = message[<span class="org-string">"from"</span>]

  <span class="org-comment-delimiter">-- </span><span class="org-comment">Discard message if the message was malformed and we could not determine the</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">"repo path".</span>
  <span class="org-keyword">if</span> repo_path == <span class="org-constant">nil</span> <span class="org-keyword">then</span>
    melbyd.log(<span class="org-string">"repo_path is nil --- dropping"</span>)
    <span class="org-keyword">return</span> <span class="org-constant">false</span>
  <span class="org-keyword">end</span>

  <span class="org-keyword">if</span> pwd == repo_path <span class="org-keyword">then</span>
    <span class="org-keyword">return</span> <span class="org-constant">true</span>
  <span class="org-keyword">end</span>

  i, _ = <span class="org-builtin">string</span>.<span class="org-builtin">find</span>(pwd, repo_path)
  <span class="org-keyword">local</span> <span class="org-variable-name">repo_path_in_pwd_hierarchy</span> = i == 1
  <span class="org-keyword">if</span> repo_path_in_pwd_hierarchy <span class="org-keyword">then</span>
    melbyd.log(<span class="org-string">"repo_path "</span> .. repo_path ..
               <span class="org-string">" is in pwd hierarchy (pwd is "</span> .. pwd .. <span class="org-string">"); KEEPING"</span>)
  <span class="org-keyword">else</span>
    melbyd.log(<span class="org-string">"repo_path "</span> .. repo_path ..
               <span class="org-string">" is NOT in pwd hierarchy (pwd is "</span> .. pwd .. <span class="org-string">"); dropping"</span>)
  <span class="org-keyword">end</span>
  <span class="org-keyword">return</span> repo_path_in_pwd_hierarchy
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">Git.message_to_string</span> (<span class="org-variable-name">message</span>, <span class="org-variable-name">pwd_pretty_options</span>)
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Example:</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">--   </span><span class="org-comment">[22:33:37] [info] [ Git ] ~/prog/melby: Staging area is now empty (nothing to commit).</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">widgets</span> = {}
  <span class="org-keyword">local</span> <span class="org-variable-name">repo_path_pretty</span> = melbyd.get_path_pretty(message[<span class="org-string">"from"</span>],
                                                  pwd_pretty_options)
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"  ["</span> .. message[<span class="org-string">"payload"</span>][<span class="org-string">"time"</span>] .. <span class="org-string">"]"</span>})
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"["</span> .. message[<span class="org-string">"payload"</span>][<span class="org-string">"level"</span>] .. <span class="org-string">"]"</span>})
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"[ Git ]"</span>, fg=<span class="org-string">"lime"</span>, styles={<span class="org-string">"bold"</span>}})
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=repo_path_pretty, fg=<span class="org-string">"yellow"</span>, styles={<span class="org-string">"bold"</span>},
                         drop_delim_right=<span class="org-constant">true</span>})
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">": "</span> .. message[<span class="org-string">"payload"</span>][<span class="org-string">"text"</span>]})

  <span class="org-keyword">return</span> melbyd.render(widgets, {str=<span class="org-string">" "</span>})
<span class="org-keyword">end</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">Function for rendering a Git model. Generates a list of widgets.</span>
<span class="org-keyword">function</span> <span class="org-function-name">Git.view</span> (<span class="org-variable-name">standard_resource</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">widgets</span> = {}
  <span class="org-keyword">local</span> <span class="org-variable-name">git</span> = standard_resource[<span class="org-string">"kvs"</span>]

  <span class="org-comment-delimiter">-- </span><span class="org-comment">If this is an initial inquiry into a brand new, uncached Git repo path</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">(uncached as in Melby has not started tracking it yet), return a special "[</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Git... ]" string.</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">We do "next(table) == nil" to check if a table is truly empty, as per</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">https://stackoverflow.com/a/1252776/437583.</span>
  <span class="org-keyword">if</span> standard_resource.status == <span class="org-string">"STANDARD_RESOURCE_STATUS_LOADING"</span> <span class="org-keyword">and</span>
    (<span class="org-builtin">next</span>(git) == <span class="org-constant">nil</span>) <span class="org-keyword">then</span>
    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"[ Git... ]"</span>})
  <span class="org-keyword">elseif</span> (<span class="org-keyword">not</span> git.bare) <span class="org-keyword">and</span> git.head_sha <span class="org-keyword">then</span>
    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"["</span>, drop_delim_right=<span class="org-constant">true</span>})
    colored_sha = melbyd.get_colorized_sha(git.head_sha, 8, 1, 1)
    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=colored_sha})

    <span class="org-keyword">if</span> git.head_branch ~= <span class="org-string">""</span> <span class="org-keyword">then</span>
      <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=git.head_branch, fg=<span class="org-string">"white"</span>, styles={<span class="org-string">"bold"</span>}})
    <span class="org-keyword">end</span>

    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=melbyd.get_relative_age_short(
                             git.head_committer_date),
                           fg=<span class="org-string">"deepskyblue"</span>})

    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=melbyd.get_truncated_personal_moniker(
                             git.head_author_name, 6),
                           fg=<span class="org-string">"lime"</span>})

    <span class="org-keyword">if</span> git.count_upstream_to_head &gt; 0 <span class="org-keyword">then</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">Unfortunately, luerl does not appear to support "\u{...}" Lua 5.3</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">syntax for encoding Unicode codepoints. So we have to use the</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">utf8.char() function instead.</span>
      <span class="org-comment-delimiter">--</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">For completeness, "&#9650;" is codepoint 0x25b2.</span>
      <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-builtin">utf8</span>.<span class="org-builtin">char</span>(0x25b2), drop_delim_right=<span class="org-constant">true</span>,
                             fg=<span class="org-string">"lime"</span>})
      <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-builtin">tostring</span>(git.count_upstream_to_head)})
    <span class="org-keyword">end</span>

    <span class="org-keyword">if</span> git.count_head_to_upstream &gt; 0 <span class="org-keyword">then</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">For completeness, "&#9660;" is codepoint 0x25bc.</span>
      <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-builtin">utf8</span>.<span class="org-builtin">char</span>(0x25bc), drop_delim_right=<span class="org-constant">true</span>,
                             fg=<span class="org-string">"red"</span>})
      <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-builtin">tostring</span>(git.count_head_to_upstream)})
    <span class="org-keyword">end</span>

    <span class="org-keyword">if</span> (git.unstaged_files + git.unstaged_files_binary +
        git.unstaged_insertions + git.unstaged_deletions) &gt; 0 <span class="org-keyword">then</span>
      <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"U"</span>, fg=<span class="org-string">"cyan"</span>, styles={<span class="org-string">"bold"</span>},
                             drop_delim_right=<span class="org-constant">true</span>})
      <span class="org-keyword">if</span> git.unstaged_files &gt; 0 <span class="org-keyword">then</span>
        <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-builtin">tostring</span>(git.unstaged_files)})
      <span class="org-keyword">end</span>
      <span class="org-keyword">if</span> git.unstaged_files_binary &gt; 0 <span class="org-keyword">then</span>
        <span class="org-comment-delimiter">-- </span><span class="org-comment">For completeness, "&#9629;" is codepoint 0x259d.</span>
        <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-builtin">utf8</span>.<span class="org-builtin">char</span>(0x259d), fg=<span class="org-string">"greenyellow"</span>,
                               styles={<span class="org-string">"bold"</span>},
                               drop_delim_left=<span class="org-constant">true</span>, drop_delim_right=<span class="org-constant">true</span>})
        <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-builtin">tostring</span>(git.unstaged_files_binary)})
      <span class="org-keyword">end</span>
      <span class="org-keyword">if</span> git.unstaged_insertions &gt; 0 <span class="org-keyword">then</span>
        <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"+"</span>, fg=<span class="org-string">"lime"</span>,
                               drop_delim_left=<span class="org-constant">true</span>, drop_delim_right=<span class="org-constant">true</span>})
        <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-builtin">tostring</span>(git.unstaged_insertions),
                               fg=<span class="org-string">"lime"</span>})
      <span class="org-keyword">end</span>
      <span class="org-keyword">if</span> git.unstaged_deletions &gt; 0 <span class="org-keyword">then</span>
        <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"-"</span>, fg=<span class="org-string">"tomato"</span>, drop_delim_left=<span class="org-constant">true</span>,
                               drop_delim_right=<span class="org-constant">true</span>})
        <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-builtin">tostring</span>(git.unstaged_deletions),
                               fg=<span class="org-string">"tomato"</span>})
      <span class="org-keyword">end</span>
    <span class="org-keyword">end</span>

    <span class="org-keyword">if</span> (git.staged_files + git.staged_files_binary +
        git.staged_insertions + git.staged_deletions) &gt; 0 <span class="org-keyword">then</span>
      <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"S"</span>, fg=<span class="org-string">"pink"</span>, styles={<span class="org-string">"bold"</span>},
                             drop_delim_right=<span class="org-constant">true</span>})
      <span class="org-keyword">if</span> git.staged_files &gt; 0 <span class="org-keyword">then</span>
        <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-builtin">tostring</span>(git.staged_files)})
      <span class="org-keyword">end</span>
      <span class="org-keyword">if</span> git.staged_files_binary &gt; 0 <span class="org-keyword">then</span>
        <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-builtin">utf8</span>.<span class="org-builtin">char</span>(0x259d), fg=<span class="org-string">"greenyellow"</span>,
                               styles={<span class="org-string">"bold"</span>},
                               drop_delim_left=<span class="org-constant">true</span>, drop_delim_right=<span class="org-constant">true</span>})
        <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-builtin">tostring</span>(git.staged_files_binary)})
      <span class="org-keyword">end</span>
      <span class="org-keyword">if</span> git.staged_insertions &gt; 0 <span class="org-keyword">then</span>
        <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"+"</span>, fg=<span class="org-string">"lime"</span>, drop_delim_left=<span class="org-constant">true</span>,
                               drop_delim_right=<span class="org-constant">true</span>})
        <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-builtin">tostring</span>(git.staged_insertions), fg=<span class="org-string">"lime"</span>})
      <span class="org-keyword">end</span>
      <span class="org-keyword">if</span> git.staged_deletions &gt; 0 <span class="org-keyword">then</span>
        <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"-"</span>, fg=<span class="org-string">"tomato"</span>, drop_delim_left=<span class="org-constant">true</span>,
                               drop_delim_right=<span class="org-constant">true</span>})
        <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-builtin">tostring</span>(git.staged_deletions), fg=<span class="org-string">"tomato"</span>})
      <span class="org-keyword">end</span>
    <span class="org-keyword">end</span>

    <span class="org-keyword">if</span> git.untracked_files &gt; 0 <span class="org-keyword">then</span>
      <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"N"</span>, drop_delim_right=<span class="org-constant">true</span>, fg=<span class="org-string">"gold"</span>,
                             styles={<span class="org-string">"bold"</span>}})
      <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-builtin">tostring</span>(git.untracked_files)})
    <span class="org-keyword">end</span>

    <span class="org-keyword">if</span> git.stash_size &gt; 0 <span class="org-keyword">then</span>
      <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"T"</span>, drop_delim_right=<span class="org-constant">true</span>, fg=<span class="org-string">"purple"</span>,
                             styles={<span class="org-string">"bold"</span>}})
      <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-builtin">tostring</span>(git.stash_size)})
    <span class="org-keyword">end</span>

    <span class="org-keyword">if</span> git.assume_unchanged_files &gt; 0 <span class="org-keyword">then</span>
      <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"A"</span>, drop_delim_right=<span class="org-constant">true</span>, fg=<span class="org-string">"red"</span>,
                             styles={<span class="org-string">"bold"</span>}})
      <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-builtin">tostring</span>(git.assume_unchanged_files)})
    <span class="org-keyword">end</span>

    <span class="org-keyword">if</span> (git.submodule_uninitialized + git.submodule_out_of_sync +
        git.submodule_merge_conflicts) &gt; 0 <span class="org-keyword">then</span>
      <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"M"</span>, drop_delim_right=<span class="org-constant">true</span>, fg=<span class="org-string">"skyblue"</span>,
                             styles={<span class="org-string">"bold"</span>}})
      <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"{"</span>, drop_delim_right=<span class="org-constant">true</span>})
      <span class="org-keyword">if</span> git.submodule_uninitialized &gt; 0 <span class="org-keyword">then</span>
        <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"not_init="</span>, drop_delim_right=<span class="org-constant">true</span>})
        <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-builtin">tostring</span>(git.submodule_uninitialized)})
      <span class="org-keyword">end</span>

      <span class="org-keyword">if</span> git.submodule_out_of_sync &gt; 0 <span class="org-keyword">then</span>
        <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"need_sync="</span>, drop_delim_right=<span class="org-constant">true</span>})
        <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-builtin">tostring</span>(git.submodule_out_of_sync)})
      <span class="org-keyword">end</span>

      <span class="org-keyword">if</span> git.submodule_merge_conflicts &gt; 0 <span class="org-keyword">then</span>
        <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"conflict="</span>, drop_delim_right=<span class="org-constant">true</span>})
        <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-builtin">tostring</span>(git.submodule_merge_conflicts)})
      <span class="org-keyword">end</span>
      <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"}"</span>, drop_delim_left=<span class="org-constant">true</span>})
    <span class="org-keyword">end</span>

    <span class="org-comment-delimiter">-- </span><span class="org-comment">Append asterisk if Melby is serving stale data.</span>
    <span class="org-keyword">if</span> standard_resource.status == <span class="org-string">"STANDARD_RESOURCE_STATUS_LOADING"</span> <span class="org-keyword">then</span>
      <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"]*"</span>, drop_delim_left=<span class="org-constant">true</span>})
    <span class="org-keyword">else</span>
      <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"]"</span>, drop_delim_left=<span class="org-constant">true</span>})
    <span class="org-keyword">end</span>
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> widgets
<span class="org-keyword">end</span>

<span class="org-keyword">return</span> Git
</pre></div><p>
Below is a script for determining the absolute size of staged contents (where
both additions and deletions are treated as positive numbers).
</p>

<div class="org-src-container"><pre class="src src-sh" id="nil-3"><span class="org-builtin">set</span> -euo pipefail

<span class="org-comment-delimiter"># </span><span class="org-comment">Example output from "git diff-index HEAD --cached" (the "..." is not literally</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">there and is used to truncate these outputs to reasonable width):</span>
<span class="org-comment-delimiter">#</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">:100644 100644 1c458f... 32db82... M      doc/melbyd-model.org</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">:100644 000000 9c4640... 000000... D      melbyd/test/sample/.melby.lua</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">:000000 100755 000000... bdfb82... A      melbyd/test/sample/staged_size.sh</span>

<span class="org-function-name">__bytes</span>()
{
  2&gt;/dev/null git cat-file -s <span class="org-string">"${1}"</span> || <span class="org-builtin">echo</span> 0
}

<span class="org-function-name">__log</span>()
{
  [[ <span class="org-string">"${log_level}"</span> == <span class="org-string">"quiet"</span> ]] &amp;&amp; <span class="org-keyword">return</span>
  <span class="org-builtin">echo</span> &gt;&amp;2 <span class="org-string">"$@"</span>
}

<span class="org-function-name">main</span>()
{
  <span class="org-variable-name">log_level</span>=<span class="org-string">"${1:-normal}"</span>

  <span class="org-variable-name">GIT_ROOT</span>=<span class="org-string">"$(</span><span class="org-sh-quoted-exec">git rev-parse --show-toplevel</span><span class="org-string">)"</span>
  <span class="org-builtin">cd</span> <span class="org-string">"${GIT_ROOT}"</span>

  <span class="org-variable-name">bare</span>=<span class="org-string">"$(</span><span class="org-sh-quoted-exec">git rev-parse --is-bare-repository</span><span class="org-string">)"</span>
  <span class="org-keyword">if</span> [[ <span class="org-string">"${bare}"</span> == true ]]; <span class="org-keyword">then</span>
      <span class="org-builtin">echo</span> 0
      <span class="org-keyword">exit</span>
  <span class="org-keyword">fi</span>

  <span class="org-builtin">mapfile</span> -t array &lt; &lt;(git diff-index HEAD --cached)

  <span class="org-variable-name">total</span>=0
  <span class="org-keyword">for</span> line<span class="org-keyword"> in</span> <span class="org-string">"${array[@]}"</span>; <span class="org-keyword">do</span>
    <span class="org-variable-name">parts</span>=($<span class="org-variable-name">line</span>)
    <span class="org-variable-name">path</span>=${<span class="org-variable-name">parts</span>[5]}

    <span class="org-comment-delimiter"># </span><span class="org-comment">If the path is not to be counted because it is treated as binary in</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">.gitattributes, skip it.</span>
    <span class="org-keyword">if</span> git check-attr diff -- <span class="org-string">"${path}"</span> | grep -q <span class="org-string">"diff: unset"</span>; <span class="org-keyword">then</span>
      <span class="org-keyword">continue</span>
    <span class="org-keyword">fi</span>

    <span class="org-variable-name">mode</span>=${<span class="org-variable-name">parts</span>[4]}
    <span class="org-variable-name">old</span>=$(<span class="org-sh-quoted-exec">__bytes ${parts[2]}</span>)
    <span class="org-variable-name">new</span>=$(<span class="org-sh-quoted-exec">__bytes ${parts[3]}</span>)
    __log <span class="org-string">"path=${path}"</span>
    __log <span class="org-string">"mode=${mode}"</span>
    __log <span class="org-string">"old=${old}"</span>
    __log <span class="org-string">"new=${new}"</span>
    <span class="org-variable-name">delta</span>=0
    <span class="org-keyword">case</span> <span class="org-string">"${mode}"</span><span class="org-keyword"> in</span>
      A) <span class="org-variable-name">delta</span>=<span class="org-string">"${new}"</span> ;;
      M) <span class="org-variable-name">delta</span>=$(<span class="org-sh-quoted-exec">( new - old </span>)) ;;
      D) <span class="org-variable-name">delta</span>=<span class="org-string">"${old}"</span> ;;
    <span class="org-keyword">esac</span>
    <span class="org-variable-name">delta</span>=<span class="org-string">"${delta#-}"</span>
    __log <span class="org-string">"delta=${delta}"</span>
    __log
    <span class="org-variable-name">total</span>=$(<span class="org-sh-quoted-exec">( total + delta </span>))
  <span class="org-keyword">done</span>

  <span class="org-builtin">echo</span> <span class="org-string">"${total}"</span>
}

main <span class="org-string">"$@"</span>
</pre></div>
</div>
