user-manual.html

<div id="outline-container-h-Fake" class="outline-5">
<h5 id="h-Fake"><span class="section-number-5">2.2.0.1.</span> Fake</h5>
<div class="outline-text-5" id="text-h-Fake">
<div class="org-src-container"><pre class="src src-lua" id="nil-4"><span class="org-keyword">local</span> <span class="org-variable-name">GitFake</span> = {}

<span class="org-comment-delimiter">-- </span><span class="org-comment">The return format is a list of tables where each element is a {input="..."",</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">output={...kvs...}}.</span>
<span class="org-keyword">function</span> <span class="org-function-name">diff_fake</span>(<span class="org-variable-name">pwd</span>, <span class="org-variable-name">time_idx</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">input</span> = <span class="org-string">""</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">output</span> = {}

  <span class="org-keyword">if</span> pwd == <span class="org-string">"/repo/a"</span> <span class="org-keyword">then</span>
    <span class="org-keyword">if</span> time_idx == 0 <span class="org-keyword">then</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">Some file changed.</span>
      input = <span class="org-string">" 1 file changed, 35 insertions(+)"</span>
      output[<span class="org-string">"unstaged_files"</span>] = 1
      output[<span class="org-string">"unstaged_insertions"</span>] = 35
      output[<span class="org-string">"unstaged_deletions"</span>] = 0
    <span class="org-keyword">elseif</span> time_idx == 1 <span class="org-keyword">then</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">Some file was changed again.</span>
      input = <span class="org-string">" 1 file changed, 32 insertions(+), 2 deletions(-)"</span>
      output[<span class="org-string">"unstaged_files"</span>] = 1
      output[<span class="org-string">"unstaged_insertions"</span>] = 32
      output[<span class="org-string">"unstaged_deletions"</span>] = 2
    <span class="org-keyword">end</span>
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> {input=input, output=output}
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">diff_cached_fake</span>(<span class="org-variable-name">pwd</span>, <span class="org-variable-name">time_idx</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">input</span> = <span class="org-string">""</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">output</span> = {}

  <span class="org-keyword">if</span> pwd == <span class="org-string">"/repo/a"</span> <span class="org-keyword">then</span>
    <span class="org-keyword">if</span> time_idx == 0 <span class="org-keyword">then</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">Some file changed.</span>
      input = <span class="org-string">" 2 files changed, 4 insertions(+)"</span>
      output[<span class="org-string">"staged_files"</span>] = 2
      output[<span class="org-string">"staged_insertions"</span>] = 4
      output[<span class="org-string">"staged_deletions"</span>] = 0
    <span class="org-keyword">elseif</span> time_idx == 1 <span class="org-keyword">then</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">Some file was changed again.</span>
      input = <span class="org-string">" 2 files changed, 4 insertions(+), 8 deletions(-)"</span>
      output[<span class="org-string">"staged_files"</span>] = 2
      output[<span class="org-string">"staged_insertions"</span>] = 4
      output[<span class="org-string">"staged_deletions"</span>] = 8
    <span class="org-keyword">else</span>
      output[<span class="org-string">"staged_files"</span>] = 0
      output[<span class="org-string">"staged_insertions"</span>] = 0
      output[<span class="org-string">"staged_deletions"</span>] = 0
    <span class="org-keyword">end</span>
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> {input=input, output=output}
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">diff_binary_fake</span>(<span class="org-variable-name">pwd</span>, <span class="org-variable-name">time_idx</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">input</span> = <span class="org-string">""</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">output</span> = {}

  <span class="org-keyword">if</span> pwd == <span class="org-string">"/repo/a"</span> <span class="org-keyword">then</span>
    <span class="org-keyword">if</span> time_idx == 0 <span class="org-keyword">then</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">No binary files changed.</span>
      input = <span class="org-string">[[</span>
<span class="org-string">5   1   doc/build-literate.org</span>
<span class="org-string">]]</span>
      output[<span class="org-string">"unstaged_files_binary"</span>] = 0
    <span class="org-keyword">elseif</span> time_idx == 1 <span class="org-keyword">then</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">One binary file changed.</span>
      input = <span class="org-string">[[</span>
<span class="org-string">5   1   doc/build-literate.org</span>
<span class="org-string">-   -   doc/melby.html</span>
<span class="org-string">]]</span>
      output[<span class="org-string">"unstaged_files_binary"</span>] = 1
    <span class="org-keyword">else</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">Two binary files changed.</span>
      input = <span class="org-string">[[</span>
<span class="org-string">5   1   doc/build-literate.org</span>
<span class="org-string">-   -   doc/melby.html</span>
<span class="org-string">-   -   foo</span>
<span class="org-string">]]</span>
      output[<span class="org-string">"unstaged_files_binary"</span>] = 2
    <span class="org-keyword">end</span>
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> {input=input, output=output}
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">diff_cached_binary_fake</span>(<span class="org-variable-name">pwd</span>, <span class="org-variable-name">time_idx</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">input</span> = <span class="org-string">""</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">output</span> = {}

  <span class="org-keyword">if</span> pwd == <span class="org-string">"/repo/a"</span> <span class="org-keyword">then</span>
    <span class="org-keyword">if</span> time_idx == 0 <span class="org-keyword">then</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">One binary file changed.</span>
      input = <span class="org-string">[[</span>
<span class="org-string">5   1   apple</span>
<span class="org-string">-   -   foo</span>
<span class="org-string">]]</span>
      output[<span class="org-string">"staged_files_binary"</span>] = 1
    <span class="org-keyword">elseif</span> time_idx == 1 <span class="org-keyword">then</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">No binary files changed.</span>
      input = <span class="org-string">[[</span>
<span class="org-string">5   1   apple</span>
<span class="org-string">]]</span>
      output[<span class="org-string">"staged_files_binary"</span>] = 0
    <span class="org-keyword">else</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">Three binary files changed.</span>
      input = <span class="org-string">[[</span>
<span class="org-string">5   1   apple</span>
<span class="org-string">-   -   foo</span>
<span class="org-string">-   -   bar</span>
<span class="org-string">-   -   baz</span>
<span class="org-string">]]</span>
      output[<span class="org-string">"staged_files_binary"</span>] = 3
    <span class="org-keyword">end</span>
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> {input=input, output=output}
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">staged_bytes_fake</span>(<span class="org-variable-name">pwd</span>, <span class="org-variable-name">time_idx</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">input</span> = <span class="org-string">""</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">output</span> = {}

  <span class="org-keyword">if</span> pwd == <span class="org-string">"/repo/a"</span> <span class="org-keyword">then</span>
    <span class="org-keyword">if</span> time_idx == 0 <span class="org-keyword">then</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">No staged bytes.</span>
      input = <span class="org-string">"0"</span>
      output[<span class="org-string">"staged_bytes"</span>] = 0
    <span class="org-keyword">elseif</span> time_idx == 1 <span class="org-keyword">then</span>
      input = <span class="org-string">"12"</span>
      output[<span class="org-string">"staged_bytes"</span>] = 12
    <span class="org-keyword">else</span>
      input = <span class="org-string">"500"</span>
      output[<span class="org-string">"staged_bytes"</span>] = 500
    <span class="org-keyword">end</span>
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> {input=input, output=output}
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">head_metadata_fake</span>(<span class="org-variable-name">pwd</span>, <span class="org-variable-name">time_idx</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">input</span> = <span class="org-string">""</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">output</span> = {}

  <span class="org-keyword">if</span> pwd == <span class="org-string">"/repo/a"</span> <span class="org-keyword">then</span>
    input = <span class="org-string">[[</span>
<span class="org-string">head_author_date,1678169218</span>
<span class="org-string">head_author_name,Foo Bar</span>
<span class="org-string">head_committer_date,1678169218</span>
<span class="org-string">head_committer_name,Foo Bar</span>
<span class="org-string">]]</span>
    output[<span class="org-string">"head_author_date"</span>] = 1678169218
    output[<span class="org-string">"head_author_name"</span>] = <span class="org-string">"Foo Bar"</span>
    output[<span class="org-string">"head_committer_date"</span>] = 1678169218
    output[<span class="org-string">"head_committer_name"</span>] = <span class="org-string">"Foo Bar"</span>
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> {input=input, output=output}
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">untracked_files_fake</span>(<span class="org-variable-name">pwd</span>, <span class="org-variable-name">time_idx</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">input</span> = <span class="org-string">""</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">output</span> = {}

  <span class="org-keyword">if</span> pwd == <span class="org-string">"/repo/a"</span> <span class="org-keyword">then</span>
    input = <span class="org-string">[[</span>
<span class="org-string">file1</span>
<span class="org-string">]]</span>
    output[<span class="org-string">"untracked_files"</span>] = 1
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> {input=input, output=output}
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">assume_unchanged_files_fake</span>(<span class="org-variable-name">pwd</span>, <span class="org-variable-name">time_idx</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">input</span> = <span class="org-string">""</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">output</span> = {}

  <span class="org-keyword">if</span> pwd == <span class="org-string">"/repo/a"</span> <span class="org-keyword">then</span>
    <span class="org-keyword">if</span> time_idx == 0 <span class="org-keyword">then</span>
      input = <span class="org-string">[[</span>
<span class="org-string">H apple</span>
<span class="org-string">h carrot</span>
<span class="org-string">]]</span>
      output[<span class="org-string">"assume_unchanged_files"</span>] = 1
    <span class="org-keyword">else</span>
      input = <span class="org-string">[[</span>
<span class="org-string">H apple</span>
<span class="org-string">H carrot</span>
<span class="org-string">]]</span>
      output[<span class="org-string">"assume_unchanged_files"</span>] = 0
    <span class="org-keyword">end</span>
  <span class="org-keyword">else</span>
    input = <span class="org-string">[[</span>
<span class="org-string">H f1</span>
<span class="org-string">]]</span>
    output[<span class="org-string">"assume_unchanged_files"</span>] = 0
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> {input=input, output=output}
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">count_head_vs_upstream_fake</span>(<span class="org-variable-name">pwd</span>, <span class="org-variable-name">time_idx</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">input</span> = <span class="org-string">""</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">output</span> = {}

  <span class="org-keyword">if</span> pwd == <span class="org-string">"/repo/a"</span> <span class="org-keyword">then</span>
    <span class="org-keyword">if</span> time_idx == 0 <span class="org-keyword">then</span>
      input = <span class="org-string">[[</span>
<span class="org-string">0   0</span>
<span class="org-string">]]</span>
      output[<span class="org-string">"count_upstream_to_head"</span>] = 0
      output[<span class="org-string">"count_head_to_upstream"</span>] = 0
    <span class="org-keyword">elseif</span> time_idx == 1 <span class="org-keyword">then</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">We created a commit.</span>
      input = <span class="org-string">[[</span>
<span class="org-string">1   0</span>
<span class="org-string">]]</span>
      output[<span class="org-string">"count_upstream_to_head"</span>] = 1
      output[<span class="org-string">"count_head_to_upstream"</span>] = 0
    <span class="org-keyword">else</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">Upstream has moved on (our local branch has diverged).</span>
      input = <span class="org-string">[[</span>
<span class="org-string">1   1</span>
<span class="org-string">]]</span>
      output[<span class="org-string">"count_upstream_to_head"</span>] = 1
      output[<span class="org-string">"count_head_to_upstream"</span>] = 1
    <span class="org-keyword">end</span>
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> {input=input, output=output}
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">head_branch_fake</span>(<span class="org-variable-name">pwd</span>, <span class="org-variable-name">time_idx</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">input</span> = <span class="org-string">""</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">output</span> = {}

  <span class="org-keyword">if</span> pwd == <span class="org-string">"/repo/a"</span> <span class="org-keyword">then</span>
    input = <span class="org-string">"main"</span>
    output[<span class="org-string">"head_branch"</span>] = <span class="org-string">"main"</span>
  <span class="org-keyword">else</span>
    input = <span class="org-string">"dev"</span>
    output[<span class="org-string">"head_branch"</span>] = <span class="org-string">"dev"</span>
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> {input=input, output=output}
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">head_sha_fake</span>(<span class="org-variable-name">pwd</span>, <span class="org-variable-name">time_idx</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">input</span> = <span class="org-string">""</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">output</span> = {}

  <span class="org-keyword">if</span> pwd == <span class="org-string">"/repo/a"</span> <span class="org-keyword">then</span>
    input = <span class="org-string">"2bf048d6364fff6f80d0f96f11447a80859f0df7"</span>
    output[<span class="org-string">"head_sha"</span>] = <span class="org-string">"2bf048d6364fff6f80d0f96f11447a80859f0df7"</span>
  <span class="org-keyword">else</span>
    input = <span class="org-string">"6ef4740cfe770f68af432fa27e0dc693dab8fce5"</span>
    output[<span class="org-string">"head_sha"</span>] = <span class="org-string">"6ef4740cfe770f68af432fa27e0dc693dab8fce5"</span>
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> {input=input, output=output}
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">bare_fake</span>(<span class="org-variable-name">pwd</span>, <span class="org-variable-name">time_idx</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">input</span> = <span class="org-string">""</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">output</span> = {}

  input = <span class="org-string">"false"</span>
  output[<span class="org-string">"bare"</span>] = <span class="org-constant">false</span>

  <span class="org-keyword">return</span> {input=input, output=output}
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">stash_size_fake</span>(<span class="org-variable-name">pwd</span>, <span class="org-variable-name">time_idx</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">input</span> = <span class="org-string">""</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">output</span> = {}

  <span class="org-keyword">if</span> pwd == <span class="org-string">"/repo/a"</span> <span class="org-keyword">then</span>
    <span class="org-keyword">if</span> time_idx == 0 <span class="org-keyword">then</span>
      output[<span class="org-string">"stash_size"</span>] = 0
    <span class="org-keyword">elseif</span> time_idx == 1 <span class="org-keyword">then</span>
      output[<span class="org-string">"stash_size"</span>] = 0
    <span class="org-keyword">else</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">Stashed some changes.</span>
      input = <span class="org-string">[[</span>
<span class="org-string">stash@{0}: WIP on main: 6ef4740 update</span>
<span class="org-string">]]</span>
      output[<span class="org-string">"stash_size"</span>] = 1
    <span class="org-keyword">end</span>
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> {input=input, output=output}
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">submodule_status_fake</span>(<span class="org-variable-name">pwd</span>, <span class="org-variable-name">time_idx</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">input</span> = <span class="org-string">""</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">output</span> = {}

  <span class="org-keyword">if</span> pwd == <span class="org-string">"/repo/a"</span> <span class="org-keyword">then</span>
    <span class="org-keyword">if</span> time_idx == 0 <span class="org-keyword">then</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">Nothing initialized.</span>
      input = <span class="org-string">[[</span>
<span class="org-string">-e827a9f3e2ba585de8b07cd246534a15ec414a8b deps/elisp/compat.el (28.1.2.2-7-ge827a9f)</span>
<span class="org-string">-0ac1ecf6b56eb67bb81a3cf70f8d4354b5782341 deps/elisp/dash.el (2.19.1-20-g0ac1ecf)</span>
<span class="org-string">-d495ed87a9c507f5939a51c740f119950c83e2ff deps/elisp/emacs-elixir (v2.3.1-135-gd495ed8)</span>
<span class="org-string">-dd27bc3f26efd728f2b1f01f9e4ac4f61f2ffbf9 deps/elisp/emacs-htmlize (release/1.56-1-gdd27bc3)</span>
<span class="org-string">-90503413f4cdb0ed26871e39c4e6e2552b57f7db deps/elisp/haskell-mode (v13.14-1398-g9050341)</span>
<span class="org-string">-d17a00ca50aee197cd017d573b83367eb241cc44 deps/elisp/lua-mode (v20210802-4-gd17a00c)</span>
<span class="org-string">-8158b484ae32d334c9db60b265759d22547ea952 deps/elisp/magit (v3.3.0-462-g8158b484)</span>
<span class="org-string">-34d51e2731408b5b615f785a83faa3d6dc2a92a1 deps/elisp/nix-mode (v1.4.1-194-g34d51e2)</span>
<span class="org-string">-061cfc002ff6ea41c622447bec22f49d618c36de deps/elisp/org-html-themify (heads/master)</span>
<span class="org-string">-f6e284f8e5dd557fde52241546a916c2e50f0d23 deps/elisp/protobuf (v3.21.6-629-gf6e284f8e)</span>
<span class="org-string">-b4537b6f5fa65626c1bab944681b35769cab9b5c deps/elisp/rust-mode (1.0.5-18-gb4537b6)</span>
<span class="org-string">-e957dcb0677da18b2bb60ad867db5df5c35b5616 deps/elisp/s.el (1.12.0-71-ge957dcb)</span>
<span class="org-string">-535800fd6ca7f5af56f7aa3d0e8f46fef8b7999b deps/elisp/themes (v2.3.0-8-g535800f)</span>
<span class="org-string">-3fcb36d6039bef57e2a0f6e24c51f623c0bf5fb7 deps/elisp/yaml-mode (release-0.0.6-132-g3fcb36d)</span>
<span class="org-string">-d8cf56bb1fa0280fe5b1a2b335dd6637f1964851 deps/misc/org-html-themes (v1.0.2-88-gd8cf56b)</span>
<span class="org-string">]]</span>
      output[<span class="org-string">"submodule_uninitialized"</span>] = 15
      output[<span class="org-string">"submodule_out_of_sync"</span>] = 0
      output[<span class="org-string">"submodule_merge_conflicts"</span>] = 0
    <span class="org-keyword">else</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">Everything has initialized.</span>
      input = <span class="org-string">[[</span>
<span class="org-string"> e827a9f3e2ba585de8b07cd246534a15ec414a8b deps/elisp/compat.el (28.1.2.2-7-ge827a9f)</span>
<span class="org-string"> 0ac1ecf6b56eb67bb81a3cf70f8d4354b5782341 deps/elisp/dash.el (2.19.1-20-g0ac1ecf)</span>
<span class="org-string"> d495ed87a9c507f5939a51c740f119950c83e2ff deps/elisp/emacs-elixir (v2.3.1-135-gd495ed8)</span>
<span class="org-string"> dd27bc3f26efd728f2b1f01f9e4ac4f61f2ffbf9 deps/elisp/emacs-htmlize (release/1.56-1-gdd27bc3)</span>
<span class="org-string"> 90503413f4cdb0ed26871e39c4e6e2552b57f7db deps/elisp/haskell-mode (v13.14-1398-g9050341)</span>
<span class="org-string"> d17a00ca50aee197cd017d573b83367eb241cc44 deps/elisp/lua-mode (v20210802-4-gd17a00c)</span>
<span class="org-string"> 8158b484ae32d334c9db60b265759d22547ea952 deps/elisp/magit (v3.3.0-462-g8158b484)</span>
<span class="org-string"> 34d51e2731408b5b615f785a83faa3d6dc2a92a1 deps/elisp/nix-mode (v1.4.1-194-g34d51e2)</span>
<span class="org-string"> 061cfc002ff6ea41c622447bec22f49d618c36de deps/elisp/org-html-themify (heads/master)</span>
<span class="org-string"> f6e284f8e5dd557fde52241546a916c2e50f0d23 deps/elisp/protobuf (v3.21.6-629-gf6e284f8e)</span>
<span class="org-string"> b4537b6f5fa65626c1bab944681b35769cab9b5c deps/elisp/rust-mode (1.0.5-18-gb4537b6)</span>
<span class="org-string"> e957dcb0677da18b2bb60ad867db5df5c35b5616 deps/elisp/s.el (1.12.0-71-ge957dcb)</span>
<span class="org-string"> 535800fd6ca7f5af56f7aa3d0e8f46fef8b7999b deps/elisp/themes (v2.3.0-8-g535800f)</span>
<span class="org-string"> 3fcb36d6039bef57e2a0f6e24c51f623c0bf5fb7 deps/elisp/yaml-mode (release-0.0.6-132-g3fcb36d)</span>
<span class="org-string"> d8cf56bb1fa0280fe5b1a2b335dd6637f1964851 deps/misc/org-html-themes (v1.0.2-88-gd8cf56b)</span>
<span class="org-string">]]</span>
      output[<span class="org-string">"submodule_uninitialized"</span>] = 0
      output[<span class="org-string">"submodule_out_of_sync"</span>] = 0
      output[<span class="org-string">"submodule_merge_conflicts"</span>] = 0
    <span class="org-keyword">end</span>
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> {input=input, output=output}
<span class="org-keyword">end</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">Note that this invokes the fake readers when it is called, so the values in</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">the table are already the generated {input=..., output=...} tables. This is</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">slightly different than the real readers where the caller still needs to run</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">System.cmd to generate the read results by shelling out.</span>
<span class="org-keyword">function</span> <span class="org-function-name">GitFake.readers</span> (<span class="org-variable-name">resource_opts</span>, <span class="org-variable-name">time_idx</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">pwd</span> = resource_opts[<span class="org-string">"PWD"</span>]
  <span class="org-keyword">return</span> {
    diff = diff_fake(pwd, time_idx),
    diff_cached = diff_cached_fake(pwd, time_idx),
    diff_binary = diff_binary_fake(pwd, time_idx),
    diff_cached_binary = diff_cached_binary_fake(pwd, time_idx),
    staged_bytes = staged_bytes_fake(pwd, time_idx),
    head_metadata = head_metadata_fake(pwd, time_idx),
    untracked_files = untracked_files_fake(pwd, time_idx),
    assume_unchanged_files = assume_unchanged_files_fake(pwd, time_idx),
    count_head_vs_upstream = count_head_vs_upstream_fake(pwd, time_idx),
    head_branch = head_branch_fake(pwd, time_idx),
    head_sha = head_sha_fake(pwd, time_idx),
    bare = bare_fake(pwd, time_idx),
    stash_size = stash_size_fake(pwd, time_idx),
    submodule_status = submodule_status_fake(pwd, time_idx),
  }
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">GitFake.resource_id_func</span> (<span class="org-variable-name">resource_opts</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">pwd</span> = resource_opts[<span class="org-string">"PWD"</span>]

  <span class="org-keyword">if</span> <span class="org-builtin">string</span>.<span class="org-builtin">find</span>(pwd, <span class="org-string">"/repo/a"</span>) <span class="org-keyword">then</span>
    <span class="org-keyword">return</span> <span class="org-string">"/repo/a"</span>
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> <span class="org-string">""</span>
<span class="org-keyword">end</span>

<span class="org-keyword">return</span> GitFake
</pre></div>
</div>
</div>
</div>
