user-manual.org
** Kubernetes (=kubectl=)

This standard resource model is based on the Git one. Like Git, it uses an
underlying CLI program (=kubectl=) to read information.

However, there are some differences with Git. Every local Git repo is tied to
the path on the filesystem, and we display Git information whenever the shell
visits the path (or a subpath) of the repo. But for Kubernetes, the current path
of the shell doesn't mean anything because we are talking about connections over
the network. Instead, the current =KUBECONFIG= environment variable determines
any special precedence rules for looking up Kubernetes contexts (similar to how
=PATH= is used for looking up a binary). Different shell processes may override
this =KUBECONFIG= variable.

In a sense, =KUBECONFIG= is like =PWD= because if it changes (or if the files
that the =KUBECONFIG= point to changes), it affects how =kubectl= will behave by
default. For example, =kubectl config get-contexts= will only consider those
contexts discoverable from =KUBECONFIG=. If =KUBECONFIG= is not set, =kubectl=
will pretend that it is set to =$HOME/.kube/config=.

There are 2 types of information we want to retrieve:

  1) The current Kubernetes context (and namespace) via =kubectl config
     current-context= (to get the current context) and =kubectl config
     get-contexts= (to get the associated non-default namespace for this context,
     if any).

  2) Cluster health information for those contexts described in
     =MELBY_KUBE_CONTEXTS=.

We assume that =MELBY_KUBE_CONTEXTS= only points to contexts that could be
reached by looking at =KUBECONFIG= (that these environment variables move in
lockstep).

We use a dedicated =KubeCurrent.lua= for getting the current context and
namespace, and a separate =Kube.lua= for reading cluster health for
=MELBY_KUBE_CONTEXTS=.

For =KubeCurrent.lua=, we use =KUBECONFIG= as our =resource_id= (for purposes of
=resource_id_command=). Any time any of the files pointed by =KUBECONFIG=
changes (filesystem watch), we mark the resource as stale and refresh our
current context/namespace information. FIXME: Test this by changing the config
file with vim on disk to point to a different namespace (and see it reflected in
our prompt).

For =Kube.lua=, we just read per-cluster information (pod availability, uptime,
etc) for /a single context/. The =resource_id= is the context name (IMPORTANT:
users should use globally unique context names). Then the user will loop through
each of the contexts found in =MELBY_KUBE_CONTEXTS= and run =Kube.read()= to get
this per-cluster information.

*** Things we have to implement
**** IN-PROGRESS SRS: create time-based staleness flagger (easy)
**** TODO SRS: create a command timeout for shell commands that take too long or error out
We should let users configure each command with an optional timeout and/or error
response detector, such that:

  - if a command times out (still is running after waiting N seconds), we cancel
    it and generate a message for SLG telling the user that a command timed out

    - this should catch cases where kubectl or gcloud return nothing due to either
      network connectivity issues (wifi missing) or missing authentication (didn't
      run =gcloud auth print-access-token= yet)

    - when the user sees the message about the command(s) misbehaving, they can
      run something that will (e.g.) reset their auth credentials so that the
      commands can work again

  - if a command errors out (and we expect it to succeed), we mark a subset of the
    entire data we read as "stale" ... ?

