user-manual.html

<div id="outline-container-h-Kubernetes---kubectl-" class="outline-3">
<h3 id="h-Kubernetes---kubectl-"><span class="section-number-3">2.3.</span> Kubernetes (<code>kubectl</code>)</h3>
<div class="outline-text-3" id="text-h-Kubernetes---kubectl-">
<p>
This standard resource model is based on the Git one. Like Git, it uses an
underlying CLI program (<code>kubectl</code>) to read information.
</p>

<p>
However, there are some differences with Git. Every local Git repo is tied to
the path on the filesystem, and we display Git information whenever the shell
visits the path (or a subpath) of the repo. But for Kubernetes, the current path
of the shell doesn't mean anything because we are talking about connections over
the network. Instead, the current <code>KUBECONFIG</code> environment variable determines
any special precedence rules for looking up Kubernetes contexts (similar to how
<code>PATH</code> is used for looking up a binary). Different shell processes may override
this <code>KUBECONFIG</code> variable.
</p>

<p>
In a sense, <code>KUBECONFIG</code> is like <code>PWD</code> because if it changes (or if the files
that the <code>KUBECONFIG</code> point to changes), it affects how <code>kubectl</code> will behave by
default. For example, <code>kubectl config get-contexts</code> will only consider those
contexts discoverable from <code>KUBECONFIG</code>. If <code>KUBECONFIG</code> is not set, <code>kubectl</code>
will pretend that it is set to <code>$HOME/.kube/config</code>.
</p>

<p>
There are 2 types of information we want to retrieve:
</p>

<ol class="org-ol">
<li>The current Kubernetes context (and namespace) via <code>kubectl config
   current-context</code> (to get the current context) and <code>kubectl config
   get-contexts</code> (to get the associated non-default namespace for this context,
if any).</li>
<li>Cluster health information for those contexts described in
<code>MELBY_KUBE_CONTEXTS</code>.</li>
</ol>

<p>
We assume that <code>MELBY_KUBE_CONTEXTS</code> only points to contexts that could be
reached by looking at <code>KUBECONFIG</code> (that these environment variables move in
lockstep).
</p>

<p>
We use a dedicated <code>KubeCurrent.lua</code> for getting the current context and
namespace, and a separate <code>Kube.lua</code> for reading cluster health for
<code>MELBY_KUBE_CONTEXTS</code>.
</p>

<p>
For <code>KubeCurrent.lua</code>, we use <code>KUBECONFIG</code> as our <code>resource_id</code> (for purposes of
<code>resource_id_command</code>). Any time any of the files pointed by <code>KUBECONFIG</code>
changes (filesystem watch), we mark the resource as stale and refresh our
current context/namespace information. FIXME: Test this by changing the config
file with vim on disk to point to a different namespace (and see it reflected in
our prompt).
</p>

<p>
For <code>Kube.lua</code>, we just read per-cluster information (pod availability, uptime,
etc) for <i>a single context</i>. The <code>resource_id</code> is the context name (IMPORTANT:
users should use globally unique context names). Then the user will loop through
each of the contexts found in <code>MELBY_KUBE_CONTEXTS</code> and run <code>Kube.read()</code> to get
this per-cluster information.
</p>
</div>

<div id="outline-container-h-Things-we-have-to-implement" class="outline-4">
<h4 id="h-Things-we-have-to-implement"><span class="section-number-4">2.3.1.</span> Things we have to implement</h4>
<div class="outline-text-4" id="text-h-Things-we-have-to-implement">
</div>
<div id="outline-container-h-IN-PROGRESS-SRS--create-time-based-staleness-flagger--easy" class="outline-5">
<h5 id="h-IN-PROGRESS-SRS--create-time-based-staleness-flagger--easy"><span class="section-number-5">2.3.1.1.</span> IN-PROGRESS SRS: create time-based staleness flagger (easy)</h5>
<div class="outline-text-5" id="text-h-IN-PROGRESS-SRS--create-time-based-staleness-flagger--easy">
</div>
</div>
<div id="outline-container-h-SRS--create-a-command-timeout-for-shell-commands-that-take-too-long-or-error-out" class="outline-5">
<h5 id="h-SRS--create-a-command-timeout-for-shell-commands-that-take-too-long-or-error-out"><span class="section-number-5">2.3.1.2.</span> <span class="todo TODO">TODO</span> SRS: create a command timeout for shell commands that take too long or error out</h5>
<div class="outline-text-5" id="text-h-SRS--create-a-command-timeout-for-shell-commands-that-take-too-long-or-error-out">
<p>
We should let users configure each command with an optional timeout and/or error
reponse detector, such that:
</p>

<ul class="org-ul">
<li>if a command times out (still is running after waiting N seconds), we cancel
it and generate a message for SLG telling the user that a command timed out
<ul class="org-ul">
<li>this should catch cases where kubectl or gcloud return nothing due to either
network connectivity issues (wifi missing) or missing authentication (didn't
run <code>gcloud auth print-access-token</code> yet)</li>
<li>when the user sees the message about the command(s) misbehaving, they can
run something that will (e.g.) reset their auth credentials so that the
commands can work again</li>
</ul></li>
<li>if a command errors out (and we expect it to succeed), we mark a subset of the
entire data we read as "stale" &#x2026; ?</li>
</ul>
</div>
</div>
</div>
