user-manual.html

<div id="outline-container-h-Implementation-for--KubeCurrent-lua---get-current-context-namespace" class="outline-4">
<h4 id="h-Implementation-for--KubeCurrent-lua---get-current-context-namespace"><span class="section-number-4">2.3.2.</span> Implementation for <code>KubeCurrent.lua</code> (get current context/namespace)</h4>
<div class="outline-text-4" id="text-h-Implementation-for--KubeCurrent-lua---get-current-context-namespace">
<div class="org-src-container"><pre class="src src-lua" id="nil-5"><span class="org-keyword">local</span> <span class="org-variable-name">KubeCurrent</span> = {}
KubeCurrent[<span class="org-string">"type"</span>] = <span class="org-string">"KubeCurrent"</span>
KubeCurrent[<span class="org-string">"history_size"</span>] = 10
KubeCurrent[<span class="org-string">"parser"</span>] = {}
KubeCurrent[<span class="org-string">"fake"</span>] = <span class="org-builtin">require</span> <span class="org-string">"KubeCurrentFake"</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">We need KUBECONFIG and HOME.</span>
<span class="org-keyword">function</span> <span class="org-function-name">KubeCurrent.read</span> (<span class="org-builtin">self</span>, <span class="org-variable-name">env</span>, <span class="org-variable-name">var_names</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">resource_opts</span> = {}
  <span class="org-keyword">for</span> <span class="org-variable-name">_</span>, <span class="org-variable-name">var_name</span> <span class="org-keyword">in</span> <span class="org-builtin">ipairs</span>(var_names) <span class="org-keyword">do</span>
    resource_opts[var_name] = env[var_name]
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> melbyd.read_standard_resource(<span class="org-builtin">self</span>, resource_opts)
<span class="org-keyword">end</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">We treat the KUBECONFIG value (after we've done any expansions of variables</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">such as HOME) as the resource_id.</span>
<span class="org-keyword">function</span> <span class="org-function-name">KubeCurrent.resource_id_func</span> (<span class="org-variable-name">resource_opts</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">s</span> = resource_opts[<span class="org-string">"KUBECONFIG"</span>]
  <span class="org-comment-delimiter">-- </span><span class="org-comment">If it's, empty, use "$HOME/.kube/config" as the default.</span>
  <span class="org-keyword">if</span> s == <span class="org-constant">nil</span> <span class="org-keyword">or</span> s == <span class="org-string">""</span> <span class="org-keyword">then</span>
    s = resource_opts[<span class="org-string">"HOME"</span>] .. <span class="org-string">"/.kube/config"</span>
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> s
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">KubeCurrent.readers</span> (<span class="org-variable-name">resource_opts</span>)
  <span class="org-keyword">return</span> {{invocation={<span class="org-string">"kubectl"</span>, <span class="org-string">"config"</span>, <span class="org-string">"get-contexts"</span>},
           parser=<span class="org-string">"current_context_and_namespace"</span>,
           env={KUBECONFIG=resource_opts[<span class="org-string">"KUBECONFIG"</span>]}}}
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">KubeCurrent.staleness_flaggers</span> (<span class="org-variable-name">resource_id</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">kubeconfig</span> = resource_id
  <span class="org-keyword">local</span> <span class="org-variable-name">filesystem</span> = {}
  filesystem[<span class="org-string">"type"</span>] = <span class="org-string">"filesystem"</span>
  filesystem[<span class="org-string">"watch_paths"</span>] = melbyd.split(kubeconfig, <span class="org-string">":"</span>)

  <span class="org-comment-delimiter">-- </span><span class="org-comment">Unilke for Git, we watch file paths directly (those specified in</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">KUBECONFIG). We treat all events as "staleness flagging", and thus</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">unconditionally return "true" here.</span>
  filesystem[<span class="org-string">"fs_event_handler"</span>] = <span class="org-keyword">function</span> (<span class="org-variable-name">path</span>, <span class="org-variable-name">events</span>)
    <span class="org-keyword">return</span> <span class="org-constant">true</span>
  <span class="org-keyword">end</span>

  <span class="org-comment-delimiter">-- </span><span class="org-comment">We can technically have multiple staleness flaggers.</span>
  <span class="org-keyword">return</span> {filesystem}
<span class="org-keyword">end</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">Split by newline, then for each line: split by whitespace to get all words.</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">then check that the first word is a "*" and use the 2nd word for the context</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">and 5th word for the namespace (if empty, use 'default')</span>
<span class="org-keyword">function</span> <span class="org-function-name">KubeCurrent.parser.current_context_and_namespace</span> (<span class="org-variable-name">s</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">ret</span> = {}

  <span class="org-keyword">local</span> <span class="org-variable-name">words</span> = {}
  <span class="org-keyword">local</span> <span class="org-variable-name">lines</span> = melbyd.get_lines_trimmed_nonempty(s)
  <span class="org-keyword">for</span> <span class="org-variable-name">_</span>, <span class="org-variable-name">line</span> <span class="org-keyword">in</span> <span class="org-builtin">ipairs</span>(lines) <span class="org-keyword">do</span>

    <span class="org-comment-delimiter">-- </span><span class="org-comment">NOTE: gmatch is not implemented in luerl; see</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">https://github.com/rvirding/luerl/issues/150. So instead we have to call</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">out to Elixir again.</span>
    words = melbyd.split(line, <span class="org-string">" "</span>)

    <span class="org-keyword">if</span> (words[1] <span class="org-keyword">or</span> <span class="org-string">""</span>) == <span class="org-string">"*"</span> <span class="org-keyword">then</span>
      <span class="org-keyword">local</span> <span class="org-variable-name">context</span> = words[2]
      <span class="org-keyword">local</span> <span class="org-variable-name">namespace</span> = words[5]
      <span class="org-keyword">if</span> context == <span class="org-constant">nil</span> <span class="org-keyword">or</span> context == <span class="org-string">""</span> <span class="org-keyword">then</span>
        <span class="org-keyword">break</span>
      <span class="org-keyword">end</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">Technically the `namespace` here will never be the empty string because</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">we only matched (of at least 1 character) some number of non-whitespace</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">characters, or we didn't and namespace (words[5]) is simply nil.</span>
      <span class="org-keyword">if</span> namespace == <span class="org-constant">nil</span> <span class="org-keyword">or</span> namespace == <span class="org-string">""</span> <span class="org-keyword">then</span>
        namespace = <span class="org-string">"default"</span>
      <span class="org-keyword">end</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">Happy path.</span>
      ret[<span class="org-string">"context"</span>] = context
      ret[<span class="org-string">"namespace"</span>] = namespace
      <span class="org-keyword">return</span> ret
    <span class="org-keyword">end</span>
  <span class="org-keyword">end</span>

  <span class="org-comment-delimiter">-- </span><span class="org-comment">Write safe defaults to make comparisons less painful in the main Lua config.</span>
  melbyd.log(<span class="org-string">"KubeCurrent returned empty string; using empty strings as defaults"</span>)
  ret[<span class="org-string">"context"</span>] = <span class="org-string">""</span>
  ret[<span class="org-string">"namespace"</span>] = <span class="org-string">""</span>
  <span class="org-keyword">return</span> ret
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">KubeCurrent.notify</span> (<span class="org-variable-name">resource_id</span>, <span class="org-variable-name">old</span>, <span class="org-variable-name">new</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">kubeconfig</span> = resource_id
  <span class="org-keyword">local</span> <span class="org-variable-name">message</span> = {}
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Generate a new message if we change the current context or namespace.</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">old_context</span> = old.kvs.context
  <span class="org-keyword">local</span> <span class="org-variable-name">new_context</span> = new.kvs.context

  <span class="org-keyword">local</span> <span class="org-variable-name">old_namespace</span> = old.kvs.namespace
  <span class="org-keyword">local</span> <span class="org-variable-name">new_namespace</span> = new.kvs.namespace

  <span class="org-keyword">if</span> new_context ~= old_context <span class="org-keyword">then</span>
    message[<span class="org-string">"topic"</span>]=<span class="org-string">"srs_KubeCurrent"</span>
    message[<span class="org-string">"from"</span>]=kubeconfig
    message[<span class="org-string">"payload"</span>]={level=<span class="org-string">"info"</span>,
                        text=<span class="org-string">"Context changed from '"</span> ..
                          old_context .. <span class="org-string">"' to '"</span> ..
                          new_context .. <span class="org-string">"'."</span>}
    melbyd.broadcast(<span class="org-string">"srs_KubeCurrent"</span>, message)
  <span class="org-keyword">end</span>

  <span class="org-keyword">if</span> new_namespace ~= old_namespace <span class="org-keyword">then</span>
    message[<span class="org-string">"topic"</span>]=<span class="org-string">"srs_KubeCurrent"</span>
    message[<span class="org-string">"from"</span>]=kubeconfig
    message[<span class="org-string">"payload"</span>]={level=<span class="org-string">"info"</span>,
                        text=<span class="org-string">"Namespace changed from '"</span> ..
                          old_namespace .. <span class="org-string">"' to '"</span> ..
                          new_namespace .. <span class="org-string">"'."</span>}
    melbyd.broadcast(<span class="org-string">"srs_KubeCurrent"</span>, message)
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> <span class="org-constant">nil</span>
<span class="org-keyword">end</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">Only keep messages if the KUBECONFIG of the message "from" matches the</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">KUBECONFIG env var used by the current shell.</span>
<span class="org-keyword">function</span> <span class="org-function-name">KubeCurrent.should_keep_message</span> (<span class="org-variable-name">message</span>, <span class="org-variable-name">env_vars</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">shell_kubeconfig</span> = env_vars[<span class="org-string">"KUBECONFIG"</span>] <span class="org-keyword">or</span> <span class="org-string">""</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">kubeconfig</span> = message[<span class="org-string">"from"</span>]

  <span class="org-keyword">return</span> shell_kubeconfig == kubeconfig
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">KubeCurrent.message_to_string</span> (<span class="org-variable-name">message</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">widgets</span> = {}
  <span class="org-keyword">local</span> <span class="org-variable-name">kubeconfig</span> = message[<span class="org-string">"from"</span>]
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"  ["</span> .. message[<span class="org-string">"payload"</span>][<span class="org-string">"time"</span>] .. <span class="org-string">"]"</span>})
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"["</span> .. message[<span class="org-string">"payload"</span>][<span class="org-string">"level"</span>] .. <span class="org-string">"]"</span>})
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"[ K8s ]"</span>, fg=<span class="org-string">"lightskyblue"</span>, styles={<span class="org-string">"bold"</span>}})
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=kubeconfig, fg=<span class="org-string">"yellow"</span>, styles={<span class="org-string">"bold"</span>},
                         drop_delim_right=<span class="org-constant">true</span>})
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">": "</span> .. message[<span class="org-string">"payload"</span>][<span class="org-string">"text"</span>]})

  <span class="org-keyword">return</span> melbyd.render(widgets, {str=<span class="org-string">" "</span>})
<span class="org-keyword">end</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">FIXME: Allow a "substrs" argument here to pull in the already-rendered</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">cluster health info, so that it is inside the closing brace at the end (also</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">adjust asterisk accordingly to be there if we're loading either the</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">KubeCurrent OR Kube standard resource statuses)</span>
<span class="org-keyword">function</span> <span class="org-function-name">KubeCurrent.view</span> (<span class="org-variable-name">standard_resource</span>, <span class="org-variable-name">health_resource_status</span>, <span class="org-variable-name">health_str</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">widgets</span> = {}
  <span class="org-keyword">local</span> <span class="org-variable-name">kubecurrent</span> = standard_resource[<span class="org-string">"kvs"</span>]

  <span class="org-keyword">if</span> standard_resource.status == <span class="org-string">"STANDARD_RESOURCE_STATUS_LOADING"</span> <span class="org-keyword">and</span>
    (<span class="org-builtin">next</span>(kubecurrent) == <span class="org-constant">nil</span>) <span class="org-keyword">then</span>
    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"[ K8s... ]"</span>})
  <span class="org-keyword">elseif</span> kubecurrent.context ~= <span class="org-string">""</span> <span class="org-keyword">and</span> kubecurrent.namespace ~= <span class="org-string">""</span> <span class="org-keyword">then</span>
    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"["</span>, drop_delim_right=<span class="org-constant">true</span>})
    <span class="org-comment-delimiter">-- </span><span class="org-comment">utf8.char(9096) is "&#9096;"</span>
    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-builtin">utf8</span>.<span class="org-builtin">char</span>(9096), fg=<span class="org-string">"lightskyblue"</span>,
                           styles={<span class="org-string">"bold"</span>}})
    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=kubecurrent.context, fg=<span class="org-string">"lightskyblue"</span>,
                           styles={<span class="org-string">"bold"</span>}, drop_delim_right=<span class="org-constant">true</span>})
    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">":"</span>, drop_delim_right=<span class="org-constant">true</span>})
    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=kubecurrent.namespace, fg=<span class="org-string">"lightsalmon"</span>})
    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=health_str, drop_delim_right=<span class="org-constant">true</span>})
    <span class="org-comment-delimiter">-- </span><span class="org-comment">Append asterisk if Melby is serving stale data.</span>
    <span class="org-keyword">if</span> standard_resource.status == <span class="org-string">"STANDARD_RESOURCE_STATUS_LOADING"</span> <span class="org-keyword">or</span>
      health_resource_status == <span class="org-string">"STANDARD_RESOURCE_STATUS_LOADING"</span> <span class="org-keyword">then</span>
      <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"]*"</span>, drop_delim_left=<span class="org-constant">true</span>})
    <span class="org-keyword">else</span>
      <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"]"</span>, drop_delim_left=<span class="org-constant">true</span>})
    <span class="org-keyword">end</span>
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> widgets
<span class="org-keyword">end</span>

<span class="org-keyword">return</span> KubeCurrent
</pre></div>
</div>
