user-manual.html

<div id="outline-container-h-Fake-1" class="outline-5">
<h5 id="h-Fake-1"><span class="section-number-5">2.3.2.1.</span> Fake</h5>
<div class="outline-text-5" id="text-h-Fake-1">
<div class="org-src-container"><pre class="src src-lua" id="nil-6"><span class="org-keyword">local</span> <span class="org-variable-name">KubeCurrentFake</span> = {}

<span class="org-comment-delimiter">-- </span><span class="org-comment">We really only use the time_idx because it's simpler here.</span>
<span class="org-keyword">function</span> <span class="org-function-name">current_context_and_namespace_fake</span>(<span class="org-variable-name">time_idx</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">input</span> = <span class="org-string">""</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">output</span> = {}

  <span class="org-keyword">if</span> time_idx == 0 <span class="org-keyword">then</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">Set to context "one".</span>
    input = <span class="org-string">[[</span>
<span class="org-string">CURRENT   NAME          CLUSTER          AUTHINFO              NAMESPACE</span>
<span class="org-string">*         one           local            cluster-admin         foo</span>
<span class="org-string">          two           two              two                   default</span>
<span class="org-string">]]</span>
    output[<span class="org-string">"context"</span>] = <span class="org-string">"one"</span>
    output[<span class="org-string">"namespace"</span>] = <span class="org-string">"foo"</span>
  <span class="org-keyword">elseif</span> time_idx == 1 <span class="org-keyword">then</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">Change to context "two".</span>
    input = <span class="org-string">[[</span>
<span class="org-string">CURRENT   NAME          CLUSTER          AUTHINFO              NAMESPACE</span>
<span class="org-string">          one           local            cluster-admin         default</span>
<span class="org-string">*         two           two              two                   bar</span>
<span class="org-string">]]</span>
    output[<span class="org-string">"context"</span>] = <span class="org-string">"two"</span>
    output[<span class="org-string">"namespace"</span>] = <span class="org-string">"bar"</span>
  <span class="org-keyword">else</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">Change to namespace "default".</span>
    input = <span class="org-string">[[</span>
<span class="org-string">CURRENT   NAME          CLUSTER          AUTHINFO              NAMESPACE</span>
<span class="org-string">          one           local            cluster-admin         default</span>
<span class="org-string">*         two           two              two                   default</span>
<span class="org-string">]]</span>
    output[<span class="org-string">"context"</span>] = <span class="org-string">"two"</span>
    output[<span class="org-string">"namespace"</span>] = <span class="org-string">"default"</span>
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> {input=input, output=output}
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">KubeCurrentFake.readers</span> (<span class="org-variable-name">resource_opts</span>, <span class="org-variable-name">time_idx</span>)
  <span class="org-comment-delimiter">-- </span><span class="org-comment">FIXME: The reader is supposed to be auto-invoked whenever the file(s)</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">pointed by KUBECONFIG env var from the client changes (filesystem watch).</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">So we need to send fake filesystem events as part of the validation</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">strategy. Sending a filesystem event is as simple as sending the</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">correctly-formed tuple to the SRS process.</span>
  <span class="org-keyword">return</span> {
    current_context_and_namespace =
      current_context_and_namespace_fake(kubeconfig, time_idx)
  }

<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">KubeCurrentFake.resource_id_func</span> (<span class="org-variable-name">resource_opts</span>)
  <span class="org-keyword">return</span> resource_opts[<span class="org-string">"KUBECONFIG"</span>]
<span class="org-keyword">end</span>

<span class="org-keyword">return</span> KubeCurrentFake
</pre></div>
</div>
</div>
</div>
