user-manual.html

<div id="outline-container-h-Fake--kubectl--for-the-test-environment" class="outline-4">
<h4 id="h-Fake--kubectl--for-the-test-environment"><span class="section-number-4">2.3.3.</span> Fake <code>kubectl</code> for the test environment</h4>
<div class="outline-text-4" id="text-h-Fake--kubectl--for-the-test-environment">
<p>
We use a fake <code>kubectl</code> script and put it in our PATH for our development shell.
This way, we can test how our <code>kubectl</code>-aware Lua configuration will behave
without actually having to deal with real Kubernetes clusters.
</p>

<p>
The asterisks in the script have to be escaped with a comma like <code>,*</code> because of
Org mode.
</p>

<div class="org-src-container"><pre class="src src-sh" id="nil-7"><span class="org-builtin">set</span> -euo pipefail

<span class="org-keyword">if</span> [[ -n <span class="org-string">"${MELBY_WANT_KUBECTL_ERROR:-}"</span> ]]; <span class="org-keyword">then</span>
    sleep 5
    <span class="org-keyword">exit</span> 1
<span class="org-keyword">fi</span>

<span class="org-variable-name">SCRIPT_ROOT</span>=<span class="org-string">"$(</span><span class="org-sh-quoted-exec">dirname "$(realpath "$0"</span><span class="org-string">)")"</span>

<span class="org-function-name">usage</span>()
{
    &gt;&amp;2 cat &lt;&lt;-EOF
<span class="org-sh-heredoc">    usage:   $0 args...</span>
<span class="org-sh-heredoc">EOF</span>
}

<span class="org-function-name">main</span>()
{
    <span class="org-keyword">if</span> (( $<span class="org-variable-name">#</span> == 0 )); <span class="org-keyword">then</span>
        usage
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>

    <span class="org-builtin">local</span> kubeconfig

    <span class="org-keyword">if</span> [[ -f <span class="org-string">"${KUBECONFIG}"</span> ]]; <span class="org-keyword">then</span>
        <span class="org-variable-name">kubeconfig</span>=<span class="org-string">"${KUBECONFIG}"</span>
    <span class="org-keyword">else</span>
        <span class="org-variable-name">kubeconfig</span>=<span class="org-string">"${SCRIPT_ROOT}/fake_kube_config"</span>
    <span class="org-keyword">fi</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">kubectl config get-contexts</span>
    <span class="org-comment-delimiter">#</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">We use the following format for fake_kube_config:</span>
    <span class="org-comment-delimiter">#</span>
    <span class="org-comment-delimiter">#   </span><span class="org-comment">current-context=one</span>
    <span class="org-comment-delimiter">#   </span><span class="org-comment">current-namespace=foo</span>
    <span class="org-comment-delimiter">#</span>
    <span class="org-keyword">if</span> [[ <span class="org-string">"${1:-}"</span> == config ]] &amp;&amp; [[ <span class="org-string">"${2:-}"</span> == get-contexts ]]; <span class="org-keyword">then</span>
        <span class="org-keyword">if</span> grep -q <span class="org-string">"current-context=one"</span> <span class="org-string">"${kubeconfig}"</span>; <span class="org-keyword">then</span>
            <span class="org-keyword">if</span> grep -q <span class="org-string">"current-namespace=foo"</span> <span class="org-string">"${kubeconfig}"</span>; <span class="org-keyword">then</span>
                cat &lt;&lt;-EOF
<span class="org-sh-heredoc">CURRENT   NAME          CLUSTER          AUTHINFO              NAMESPACE</span>
<span class="org-sh-heredoc">*         one           local            cluster-admin         foo</span>
<span class="org-sh-heredoc">            two           two              two                   default</span>
<span class="org-sh-heredoc">EOF</span>
            <span class="org-keyword">else</span>
                cat &lt;&lt;-EOF
<span class="org-sh-heredoc">CURRENT   NAME          CLUSTER          AUTHINFO              NAMESPACE</span>
<span class="org-sh-heredoc">*         one           local            cluster-admin         default</span>
<span class="org-sh-heredoc">            two           two              two                   default</span>
<span class="org-sh-heredoc">EOF</span>
            <span class="org-keyword">fi</span>
        <span class="org-keyword">else</span>
            <span class="org-keyword">if</span> grep -q <span class="org-string">"current-namespace=bar"</span> <span class="org-string">"${kubeconfig}"</span>; <span class="org-keyword">then</span>
                cat &lt;&lt;-EOF
<span class="org-sh-heredoc">CURRENT   NAME          CLUSTER          AUTHINFO              NAMESPACE</span>
<span class="org-sh-heredoc">            one           local            cluster-admin         default</span>
<span class="org-sh-heredoc">*         two           two              two                   bar</span>
<span class="org-sh-heredoc">EOF</span>
            <span class="org-keyword">else</span>
                cat &lt;&lt;-EOF
<span class="org-sh-heredoc">CURRENT   NAME          CLUSTER          AUTHINFO              NAMESPACE</span>
<span class="org-sh-heredoc">            one           local            cluster-admin         default</span>
<span class="org-sh-heredoc">*         two           two              two                   default</span>
<span class="org-sh-heredoc">EOF</span>
            <span class="org-keyword">fi</span>
        <span class="org-keyword">fi</span>
    <span class="org-keyword">fi</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">We are lazy and don't even bother checking that the 3rd and 4th arguments</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">are of the form "-o" and "go-template-file=...", which this part is</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">simulating.</span>
    <span class="org-keyword">if</span> [[ <span class="org-string">"${1:-}"</span> == get ]] &amp;&amp; [[ <span class="org-string">"${2:-}"</span> == pods ]] ; <span class="org-keyword">then</span>
        <span class="org-builtin">shift</span> 4
        <span class="org-builtin">local</span> context
        <span class="org-builtin">local</span> namespace
        <span class="org-variable-name">context</span>=<span class="org-string">"${1#*=}"</span>
        <span class="org-variable-name">namespace</span>=<span class="org-string">"${2#*=}"</span>
        <span class="org-keyword">if</span> [[ <span class="org-string">"${context}"</span> == one ]]; <span class="org-keyword">then</span>
            <span class="org-comment-delimiter"># </span><span class="org-comment">FIXME: Move these stdout contents to a file, and switch between</span>
            <span class="org-comment-delimiter"># </span><span class="org-comment">them based on a separate "state" file, just like fake_kube_config.</span>
            cat &lt;&lt;-EOF
<span class="org-sh-heredoc">            Pending</span>
<span class="org-sh-heredoc">            Pending</span>
<span class="org-sh-heredoc">            Pending</span>
<span class="org-sh-heredoc">            Pending</span>
<span class="org-sh-heredoc">            Pending</span>
<span class="org-sh-heredoc">            Running</span>
<span class="org-sh-heredoc">            Running</span>
<span class="org-sh-heredoc">            Unknown</span>
<span class="org-sh-heredoc">            EOF</span>
        <span class="org-keyword">else</span>
            cat &lt;&lt;-EOF
<span class="org-sh-heredoc">            Pending</span>
<span class="org-sh-heredoc">            Failed</span>
<span class="org-sh-heredoc">            Failed</span>
<span class="org-sh-heredoc">            Succeeded</span>
<span class="org-sh-heredoc">            EOF</span>
        <span class="org-keyword">fi</span>
    <span class="org-keyword">fi</span>
}

main <span class="org-string">"$@"</span>
</pre></div>
</div>
</div>
