user-manual.html

<div id="outline-container-h-Implementation-for--Kube-lua---get-per-cluster-information" class="outline-4">
<h4 id="h-Implementation-for--Kube-lua---get-per-cluster-information"><span class="section-number-4">2.3.4.</span> Implementation for <code>Kube.lua</code> (get per-cluster information)</h4>
<div class="outline-text-4" id="text-h-Implementation-for--Kube-lua---get-per-cluster-information">
<div class="org-src-container"><pre class="src src-lua" id="nil-8"><span class="org-keyword">local</span> <span class="org-variable-name">Kube</span> = {}
Kube[<span class="org-string">"type"</span>] = <span class="org-string">"Kube"</span>
Kube[<span class="org-string">"history_size"</span>] = 10
Kube[<span class="org-string">"parser"</span>] = {}
Kube[<span class="org-string">"fake"</span>] = <span class="org-builtin">require</span> <span class="org-string">"KubeFake"</span>

<span class="org-keyword">function</span> <span class="org-function-name">Kube.read</span> (<span class="org-builtin">self</span>, <span class="org-variable-name">context</span>, <span class="org-variable-name">namespace</span>, <span class="org-variable-name">melby_dir</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">resource_opts</span> = {}
  resource_opts[<span class="org-string">"context"</span>] = context
  resource_opts[<span class="org-string">"namespace"</span>] = namespace <span class="org-keyword">or</span> <span class="org-string">"default"</span>
  resource_opts[<span class="org-string">"MELBY_DIR"</span>] = melby_dir

  <span class="org-keyword">return</span> melbyd.read_standard_resource(<span class="org-builtin">self</span>, resource_opts)
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">Kube.resource_id_func</span> (<span class="org-variable-name">resource_opts</span>)
  <span class="org-keyword">return</span> resource_opts[<span class="org-string">"context"</span>] .. <span class="org-string">":"</span> .. resource_opts[<span class="org-string">"namespace"</span>]
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">Kube.readers</span> (<span class="org-variable-name">resource_opts</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">context</span> = resource_opts[<span class="org-string">"context"</span>]
  <span class="org-keyword">local</span> <span class="org-variable-name">namespace</span> = resource_opts[<span class="org-string">"namespace"</span>]

  <span class="org-keyword">local</span> <span class="org-variable-name">readers</span> = {
    {invocation={<span class="org-string">"kubectl"</span>, <span class="org-string">"get"</span>, <span class="org-string">"pods"</span>, <span class="org-string">"-o"</span>,
                 <span class="org-string">"go-template-file="</span> ..
                   resource_opts[<span class="org-string">"MELBY_DIR"</span>] ..
                   <span class="org-string">"/get_pods.gotemplate"</span>,
                 <span class="org-string">"--context="</span> .. context,
                 <span class="org-string">"--namespace="</span> .. namespace},
     parser=<span class="org-string">"get_pods"</span>},
  }
  <span class="org-keyword">return</span> readers
<span class="org-keyword">end</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">We use a time-based staleness flagger which marks the model as stale every 2</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">seconds, just like the default setting of the `watch` UNIX command.</span>
<span class="org-keyword">function</span> <span class="org-function-name">Kube.staleness_flaggers</span> (<span class="org-variable-name">repo_root</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">duration</span> = {}
  duration[<span class="org-string">"type"</span>] = <span class="org-string">"duration"</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Mark as stale every 2 seconds (ISO 8601 format).</span>
  duration[<span class="org-string">"duration"</span>] = <span class="org-string">"PT2S"</span>

  <span class="org-keyword">return</span> {duration}
<span class="org-keyword">end</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">This is from the go template.</span>
<span class="org-keyword">function</span> <span class="org-function-name">Kube.parser.get_pods</span> (<span class="org-variable-name">s</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">ret</span> = {}
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Example input strings (format is "PHASE"):</span>
  <span class="org-comment-delimiter">--    </span><span class="org-comment">Running</span>
  <span class="org-comment-delimiter">--    </span><span class="org-comment">Pending</span>

  <span class="org-keyword">local</span> <span class="org-variable-name">phases</span> = melbyd.get_lines_trimmed_nonempty(s)

  <span class="org-comment-delimiter">-- </span><span class="org-comment">How many pods are listed?</span>
  ret[<span class="org-string">"pods"</span>] = #phases

  <span class="org-keyword">local</span> <span class="org-variable-name">count</span> = 0

  <span class="org-comment-delimiter">-- </span><span class="org-comment">Construct mapping of pod phases and the number of pods in that phase.</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">See https://kubernetes.io/docs/concepts/workloads/pods/pod-lifecycle/#pod-phase.</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">The 5 possible phase values are: Pending, Running, Succeeded, Failed, Unknown.</span>
  ret[<span class="org-string">"pods_in_phase_Pending"</span>] = 0
  ret[<span class="org-string">"pods_in_phase_Running"</span>] = 0
  ret[<span class="org-string">"pods_in_phase_Succeeded"</span>] = 0
  ret[<span class="org-string">"pods_in_phase_Failed"</span>] = 0
  ret[<span class="org-string">"pods_in_phase_Unknown"</span>] = 0
  <span class="org-keyword">for</span> <span class="org-variable-name">_</span>, <span class="org-variable-name">phase</span> <span class="org-keyword">in</span> <span class="org-builtin">ipairs</span>(phases) <span class="org-keyword">do</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">The "or 0" here only takes effect if we see an unknown phase. Basically</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">it should never happen.</span>
    count = ret[<span class="org-string">"pods_in_phase_"</span> .. phase] <span class="org-keyword">or</span> 0
    ret[<span class="org-string">"pods_in_phase_"</span> .. phase] = count + 1
  <span class="org-keyword">end</span>

  <span class="org-comment-delimiter">-- </span><span class="org-comment">FIXME: Move this to the View section, because we shouldn't store redundant</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">data.</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Of the listed pods, how many are in a healthy "Running" phase? This is</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">useful for service clusters where the pods are long-lived services that are</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">expected to always be in a "Running" state (being available).</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">string.format("%.1f%%", p*100) -&gt; "50.0%" for 1/2</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">if #phases == 0 then</span>
<span class="org-comment-delimiter">--   </span><span class="org-comment">ret["pods_percent_in_phase_Pending"]   = 0.0</span>
<span class="org-comment-delimiter">--   </span><span class="org-comment">ret["pods_percent_in_phase_Running"]   = 0.0</span>
<span class="org-comment-delimiter">--   </span><span class="org-comment">ret["pods_percent_in_phase_Succeeded"] = 0.0</span>
<span class="org-comment-delimiter">--   </span><span class="org-comment">ret["pods_percent_in_phase_Failed"]    = 0.0</span>
<span class="org-comment-delimiter">--   </span><span class="org-comment">ret["pods_percent_in_phase_Unknown"]   = 0.0</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">else</span>
<span class="org-comment-delimiter">--   </span><span class="org-comment">ret["pods_percent_in_phase_Pending"]   = ret["pods_in_phase_Pending"]   / #phases</span>
<span class="org-comment-delimiter">--   </span><span class="org-comment">ret["pods_percent_in_phase_Running"]   = ret["pods_in_phase_Running"]   / #phases</span>
<span class="org-comment-delimiter">--   </span><span class="org-comment">ret["pods_percent_in_phase_Succeeded"] = ret["pods_in_phase_Succeeded"] / #phases</span>
<span class="org-comment-delimiter">--   </span><span class="org-comment">ret["pods_percent_in_phase_Failed"]    = ret["pods_in_phase_Failed"]    / #phases</span>
<span class="org-comment-delimiter">--   </span><span class="org-comment">ret["pods_percent_in_phase_Unknown"]   = ret["pods_in_phase_Unknown"]   / #phases</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">end</span>

  <span class="org-keyword">return</span> ret
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">Kube.notify</span> (<span class="org-variable-name">resource_id</span>, <span class="org-variable-name">old</span>, <span class="org-variable-name">new</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">context_and_namespace</span> = resource_id
  <span class="org-keyword">local</span> <span class="org-variable-name">message</span> = {}
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Show a diff of all phase buckets. Also output a number of all running pods</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">(as a basic sanity check that N pods are running for some service cluster).</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Something like:</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">--    </span><span class="org-comment">Pods: Total 6 (-3), Pending 4 (+1), Running 2 (-4), Succeeded 0, Failed 0, Unknown 0</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Where we display the totals and the difference (vs old state in totals but</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">also as a percentage) in parentheses.</span>

  <span class="org-keyword">local</span> <span class="org-variable-name">diff_found</span> = <span class="org-constant">false</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">delta</span> = {}
  <span class="org-keyword">local</span> <span class="org-function-name">delta_with_sign</span> = <span class="org-keyword">function</span> (<span class="org-variable-name">n</span>)
    <span class="org-keyword">if</span> n &lt; 0 <span class="org-keyword">then</span>
      <span class="org-keyword">return</span> melbyd.render(
        {{str=<span class="org-builtin">tostring</span>(n), fg=<span class="org-string">"red"</span>, styles={<span class="org-string">"bold"</span>}}},
        {str=<span class="org-string">" "</span>})
    <span class="org-keyword">end</span>

    <span class="org-keyword">return</span> melbyd.render(
      {{str=<span class="org-string">"+"</span> .. n, fg=<span class="org-string">"lime"</span>, styles={<span class="org-string">"bold"</span>}}},
      {str=<span class="org-string">" "</span>})
  <span class="org-keyword">end</span>

  <span class="org-keyword">local</span> <span class="org-variable-name">keys</span> = {
    <span class="org-string">"pods"</span>,
    <span class="org-string">"pods_in_phase_Pending"</span>,
    <span class="org-string">"pods_in_phase_Running"</span>,
    <span class="org-string">"pods_in_phase_Succeeded"</span>,
    <span class="org-string">"pods_in_phase_Failed"</span>,
    <span class="org-string">"pods_in_phase_Unknown"</span>,
  }
  <span class="org-keyword">local</span> <span class="org-variable-name">key_display_name</span> = {}
  key_display_name[<span class="org-string">"pods"</span>] = <span class="org-string">"Total"</span>
  key_display_name[<span class="org-string">"pods_in_phase_Pending"</span>] = <span class="org-string">"Pending"</span>
  key_display_name[<span class="org-string">"pods_in_phase_Running"</span>] = <span class="org-string">"Running"</span>
  key_display_name[<span class="org-string">"pods_in_phase_Succeeded"</span>] = <span class="org-string">"Succeeded"</span>
  key_display_name[<span class="org-string">"pods_in_phase_Failed"</span>] = <span class="org-string">"Failed"</span>
  key_display_name[<span class="org-string">"pods_in_phase_Unknown"</span>] = <span class="org-string">"Unknown"</span>

  <span class="org-keyword">for</span> <span class="org-variable-name">_</span>, <span class="org-variable-name">key</span> <span class="org-keyword">in</span> <span class="org-builtin">ipairs</span>(keys) <span class="org-keyword">do</span>
    <span class="org-keyword">local</span> <span class="org-variable-name">old_val</span> = old.kvs[key]
    <span class="org-keyword">local</span> <span class="org-variable-name">new_val</span> = new.kvs[key]
    delta[key] = new_val - old_val
    diff_found = diff_found <span class="org-keyword">or</span> (old_val ~= new_val)
  <span class="org-keyword">end</span>

  <span class="org-keyword">if</span> diff_found <span class="org-keyword">then</span>
    <span class="org-keyword">local</span> <span class="org-variable-name">text</span> = <span class="org-string">"Pods:"</span>
    <span class="org-keyword">for</span> <span class="org-variable-name">i</span>, <span class="org-variable-name">key</span> <span class="org-keyword">in</span> <span class="org-builtin">ipairs</span>(keys) <span class="org-keyword">do</span>
      <span class="org-keyword">local</span> <span class="org-variable-name">sep</span> = <span class="org-string">", "</span>
      <span class="org-keyword">if</span> i == 1 <span class="org-keyword">then</span>
        sep = <span class="org-string">" "</span>
      <span class="org-keyword">end</span>
      text = text .. sep ..
        <span class="org-builtin">string</span>.<span class="org-builtin">format</span>(<span class="org-string">"%s %d"</span>, key_display_name[key], new.kvs[key])
      <span class="org-keyword">if</span> delta[key] ~= 0 <span class="org-keyword">then</span>
        text = text .. <span class="org-builtin">string</span>.<span class="org-builtin">format</span>(<span class="org-string">" (%s)"</span>, delta_with_sign(delta[key]))
      <span class="org-keyword">end</span>
    <span class="org-keyword">end</span>
    message[<span class="org-string">"topic"</span>]=<span class="org-string">"srs_Kube"</span>
    message[<span class="org-string">"from"</span>]=context_and_namespace
    message[<span class="org-string">"payload"</span>]={level=<span class="org-string">"info"</span>, text=text}
    melbyd.broadcast(<span class="org-string">"srs_Kube"</span>, message)
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> <span class="org-constant">nil</span>
<span class="org-keyword">end</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">This resource is generally meant for detecting cluster health (pod stats), so</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">it's conceivable that all shells would like to know about this. So we just</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">always return "true".</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">FIXME: Is there a better default for this?</span>
<span class="org-keyword">function</span> <span class="org-function-name">Kube.should_keep_message</span> (<span class="org-variable-name">message</span>, <span class="org-variable-name">env_vars</span>)
  <span class="org-keyword">return</span> <span class="org-constant">true</span>
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">Kube.message_to_string</span> (<span class="org-variable-name">message</span>, <span class="org-variable-name">pwd_pretty_options</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">widgets</span> = {}
  <span class="org-keyword">local</span> <span class="org-variable-name">context_and_namespace_array</span> = melbyd.split(message[<span class="org-string">"from"</span>], <span class="org-string">":"</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">context</span> = context_and_namespace_array[1]
  <span class="org-keyword">local</span> <span class="org-variable-name">namespace</span> = context_and_namespace_array[2]
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"  ["</span> .. message[<span class="org-string">"payload"</span>][<span class="org-string">"time"</span>] .. <span class="org-string">"]"</span>})
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"["</span> .. message[<span class="org-string">"payload"</span>][<span class="org-string">"level"</span>] .. <span class="org-string">"]"</span>})
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"[ K8s (Cluster Health) ]"</span>, fg=<span class="org-string">"lightskyblue"</span>,
                         styles={<span class="org-string">"bold"</span>}})
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=context, drop_delim_right=<span class="org-constant">true</span>, fg=<span class="org-string">"lightskyblue"</span>,
                         styles={<span class="org-string">"bold"</span>}})
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">":"</span>, drop_delim_right=<span class="org-constant">true</span>})
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=namespace, drop_delim_right=<span class="org-constant">true</span>, fg=<span class="org-string">"lightsalmon"</span>})
  <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">": "</span> .. message[<span class="org-string">"payload"</span>][<span class="org-string">"text"</span>]})

  <span class="org-keyword">return</span> melbyd.render(widgets, {str=<span class="org-string">" "</span>})
<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">Kube.view</span> (<span class="org-variable-name">standard_resource</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">widgets</span> = {}
  <span class="org-keyword">local</span> <span class="org-variable-name">kube</span> = standard_resource[<span class="org-string">"kvs"</span>]

  <span class="org-comment-delimiter">-- </span><span class="org-comment">Display pod information in a compact way.</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">Example:</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">--    </span><span class="org-comment">10T 1p 5r 1s 2f 0u</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">for 10 total pods, 1 pending, 5 running, 1 succeeded, 2 failed, 0 unknown.</span>
  <span class="org-comment-delimiter">--</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">FIXME: Display percentages instead of raw pod counts. We already get raw</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">pod counts in the messaging part.</span>
  <span class="org-keyword">if</span> standard_resource.status == <span class="org-string">"STANDARD_RESOURCE_STATUS_LOADING"</span> <span class="org-keyword">and</span>
    (<span class="org-builtin">next</span>(kube) == <span class="org-constant">nil</span>) <span class="org-keyword">then</span>
    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=<span class="org-string">"(pods...)"</span>})
  <span class="org-keyword">elseif</span> kube.pods ~= <span class="org-constant">nil</span> <span class="org-keyword">then</span>
    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=kube.pods .. <span class="org-string">"T"</span>})
    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=kube.pods_in_phase_Pending .. <span class="org-string">"p"</span>})
    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=kube.pods_in_phase_Running .. <span class="org-string">"r"</span>})
    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=kube.pods_in_phase_Succeeded .. <span class="org-string">"s"</span>})
    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=kube.pods_in_phase_Failed .. <span class="org-string">"f"</span>})
    <span class="org-builtin">table</span>.<span class="org-builtin">insert</span>(widgets, {str=kube.pods_in_phase_Unknown .. <span class="org-string">"u"</span>})
    <span class="org-comment-delimiter">-- </span><span class="org-comment">Unlike for Git, we don't append an asterisk if we are serving "stale"</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">data because technically the data is always stale and it is constantly</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">refreshed.</span>
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> widgets
<span class="org-keyword">end</span>

<span class="org-keyword">return</span> Kube
</pre></div><p>
This is the template for the "get_pods" reader. Format is just "&lt;STATUS&gt;".
</p>

<div class="org-src-container"><pre class="src src-text" id="nil-9">{{- range .items -}}
{{.status.phase}}{{"\n"}}
{{- end -}}
</pre></div>
</div>
