user-manual.html

<div id="outline-container-h-Fake-2" class="outline-5">
<h5 id="h-Fake-2"><span class="section-number-5">2.3.4.1.</span> Fake</h5>
<div class="outline-text-5" id="text-h-Fake-2">
<div class="org-src-container"><pre class="src src-lua" id="nil-10"><span class="org-keyword">local</span> <span class="org-variable-name">KubeFake</span> = {}

<span class="org-comment-delimiter">-- </span><span class="org-comment">time_idx is a point in time. It captures the idea of running this function</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">multiple times. If we want to always return the same result, we can ignore</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">the time_idx. But if we want to return certain values in a particular order,</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">we can use this time_idx, where 0 means the first time this function is</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">called, 1 is the next time, and so on. The time_idx will always wrap back to</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">0 after reaching FIXME (max time_idx value).</span>
<span class="org-keyword">function</span> <span class="org-function-name">get_pods_fake</span>(<span class="org-variable-name">context</span>, <span class="org-variable-name">namespace</span>, <span class="org-variable-name">time_idx</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">input</span> = <span class="org-string">""</span>
  <span class="org-keyword">local</span> <span class="org-variable-name">output</span> = {}

  <span class="org-keyword">if</span> context == <span class="org-string">"one"</span> <span class="org-keyword">then</span>
    <span class="org-keyword">if</span> time_idx == 0 <span class="org-keyword">then</span>
      input = <span class="org-string">[[</span>
<span class="org-string">Pending</span>
<span class="org-string">Pending</span>
<span class="org-string">Pending</span>
<span class="org-string">Pending</span>
<span class="org-string">Pending</span>
<span class="org-string">Running</span>
<span class="org-string">Running</span>
<span class="org-string">Unknown</span>
<span class="org-string">]]</span>
      output[<span class="org-string">"pods"</span>] = 8
      output[<span class="org-string">"pods_in_phase_Pending"</span>] = 5
      output[<span class="org-string">"pods_in_phase_Running"</span>] = 2
      output[<span class="org-string">"pods_in_phase_Succeeded"</span>] = 0
      output[<span class="org-string">"pods_in_phase_Failed"</span>] = 0
      output[<span class="org-string">"pods_in_phase_Unknown"</span>] = 1
    <span class="org-keyword">elseif</span> time_idx == 1 <span class="org-keyword">then</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">More things have started running.</span>
      input = <span class="org-string">[[</span>
<span class="org-string">Running</span>
<span class="org-string">Running</span>
<span class="org-string">Running</span>
<span class="org-string">Running</span>
<span class="org-string">Running</span>
<span class="org-string">Running</span>
<span class="org-string">Running</span>
<span class="org-string">Unknown</span>
<span class="org-string">]]</span>
      output[<span class="org-string">"pods"</span>] = 8
      output[<span class="org-string">"pods_in_phase_Pending"</span>] = 0
      output[<span class="org-string">"pods_in_phase_Running"</span>] = 7
      output[<span class="org-string">"pods_in_phase_Succeeded"</span>] = 0
      output[<span class="org-string">"pods_in_phase_Failed"</span>] = 0
      output[<span class="org-string">"pods_in_phase_Unknown"</span>] = 1
    <span class="org-keyword">else</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">Everything is running OK (including the previously unknown one)!</span>
      input = <span class="org-string">[[</span>
<span class="org-string">Running</span>
<span class="org-string">Running</span>
<span class="org-string">Running</span>
<span class="org-string">Running</span>
<span class="org-string">Running</span>
<span class="org-string">Running</span>
<span class="org-string">Running</span>
<span class="org-string">Running</span>
<span class="org-string">]]</span>
      output[<span class="org-string">"pods"</span>] = 8
      output[<span class="org-string">"pods_in_phase_Pending"</span>] = 0
      output[<span class="org-string">"pods_in_phase_Running"</span>] = 8
      output[<span class="org-string">"pods_in_phase_Succeeded"</span>] = 0
      output[<span class="org-string">"pods_in_phase_Failed"</span>] = 0
      output[<span class="org-string">"pods_in_phase_Unknown"</span>] = 0
    <span class="org-keyword">end</span>
  <span class="org-keyword">else</span>
    <span class="org-keyword">if</span> time_idx == 0 <span class="org-keyword">then</span>
      input = <span class="org-string">[[</span>
<span class="org-string">Pending</span>
<span class="org-string">Failed</span>
<span class="org-string">Failed</span>
<span class="org-string">Succeeded</span>
<span class="org-string">]]</span>
      output[<span class="org-string">"pods"</span>] = 4
      output[<span class="org-string">"pods_in_phase_Pending"</span>] = 1
      output[<span class="org-string">"pods_in_phase_Running"</span>] = 0
      output[<span class="org-string">"pods_in_phase_Succeeded"</span>] = 1
      output[<span class="org-string">"pods_in_phase_Failed"</span>] = 2
      output[<span class="org-string">"pods_in_phase_Unknown"</span>] = 0
    <span class="org-keyword">elseif</span> time_idx == 1 <span class="org-keyword">then</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">The pending pod succeeded.</span>
      input = <span class="org-string">[[</span>
<span class="org-string">Succeeded</span>
<span class="org-string">Failed</span>
<span class="org-string">Failed</span>
<span class="org-string">Succeeded</span>
<span class="org-string">]]</span>
      output[<span class="org-string">"pods"</span>] = 4
      output[<span class="org-string">"pods_in_phase_Pending"</span>] = 0
      output[<span class="org-string">"pods_in_phase_Running"</span>] = 0
      output[<span class="org-string">"pods_in_phase_Succeeded"</span>] = 2
      output[<span class="org-string">"pods_in_phase_Failed"</span>] = 2
      output[<span class="org-string">"pods_in_phase_Unknown"</span>] = 0
    <span class="org-keyword">else</span>
      <span class="org-comment-delimiter">-- </span><span class="org-comment">The older pods were deleted.</span>
      input = <span class="org-string">[[</span>
<span class="org-string">Succeeded</span>
<span class="org-string">]]</span>
      output[<span class="org-string">"pods"</span>] = 1
      output[<span class="org-string">"pods_in_phase_Pending"</span>] = 0
      output[<span class="org-string">"pods_in_phase_Running"</span>] = 0
      output[<span class="org-string">"pods_in_phase_Succeeded"</span>] = 1
      output[<span class="org-string">"pods_in_phase_Failed"</span>] = 0
      output[<span class="org-string">"pods_in_phase_Unknown"</span>] = 0
    <span class="org-keyword">end</span>
  <span class="org-keyword">end</span>

  <span class="org-keyword">return</span> {input=input, output=output}
<span class="org-keyword">end</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">This "readers" function mirrors the regular "readers" function, except that</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">it requires an additional "time_idx".</span>
<span class="org-keyword">function</span> <span class="org-function-name">KubeFake.readers</span> (<span class="org-variable-name">resource_opts</span>, <span class="org-variable-name">time_idx</span>)
  <span class="org-keyword">local</span> <span class="org-variable-name">context</span> = resource_opts[<span class="org-string">"context"</span>]
  <span class="org-keyword">local</span> <span class="org-variable-name">namespace</span> = resource_opts[<span class="org-string">"namespace"</span>]

  <span class="org-keyword">return</span> {
    <span class="org-comment-delimiter">-- </span><span class="org-comment">For the "get_pods" parser, use the get_pods_fake function.</span>
    get_pods = get_pods_fake(context, namespace, time_idx)
  }

<span class="org-keyword">end</span>

<span class="org-keyword">function</span> <span class="org-function-name">KubeFake.resource_id_func</span> (<span class="org-variable-name">resource_opts</span>)
  <span class="org-keyword">return</span> resource_opts[<span class="org-string">"context"</span>] .. <span class="org-string">":"</span> .. resource_opts[<span class="org-string">"namespace"</span>]
<span class="org-keyword">end</span>

<span class="org-keyword">return</span> KubeFake
</pre></div>
</div>
</div>
</div>
</div>
