user-manual.html

<div id="outline-container-h-On-correctness" class="outline-3">
<h3 id="h-On-correctness"><span class="section-number-3">2.4.</span> On correctness</h3>
<div class="outline-text-3" id="text-h-On-correctness">
<p>
FIXME: The sample above is actually part of a test case we use in Melby. You can
be confident that the above example will always work.
</p>

<p>
FIXME: Maybe create some "standard configuration library" of pre-configured Lua
modules for users. For example, we could promote the above "Git" module (and
maybe another Kubernetes one) into a standard folder that ships with Melby.
</p>

<p>
Below is a sample shell script that calls <code>melbyc</code> as a real example. You can use
something similar to set your own shell prompt &#x2014; as <code>melbyc</code> here just outputs
a shell script, you just need to source it and use the variables, just like in
the <code>main()</code> function.
</p>

<div class="org-src-container"><pre class="src src-sh" id="nil-11"><span class="org-builtin">set</span> -euo pipefail

<span class="org-variable-name">SCRIPT_ROOT</span>=<span class="org-string">"$(</span><span class="org-sh-quoted-exec">dirname "$(realpath "$0"</span><span class="org-string">)")"</span>

<span class="org-builtin">export</span> <span class="org-variable-name">HOST</span>=<span class="org-string">"somehost"</span>
<span class="org-builtin">export</span> <span class="org-variable-name">MELBY_ZSH_KEYMAP_INDICATOR</span>=<span class="org-string">"${1:-I}"</span>
<span class="org-builtin">export</span> <span class="org-variable-name">MELBY_LAST_CMD_EXIT_STATUS</span>=<span class="org-string">"${2:-127}"</span>
<span class="org-builtin">export</span> <span class="org-variable-name">MELBY_PATH_ALIASES_FILE</span>=<span class="org-string">"${SCRIPT_ROOT}/sample/path-aliases"</span>
<span class="org-builtin">export</span> MELBY_WANT_KUBECTL_ERROR
<span class="org-variable-name">MELBY_DIR</span>=<span class="org-string">"${SCRIPT_ROOT}/sample"</span>
<span class="org-variable-name">LUA_PATH</span>=<span class="org-string">"${SCRIPT_ROOT}/sample/?.lua"</span>
<span class="org-variable-name">MELBYC_PATH</span>=<span class="org-string">"${SCRIPT_ROOT}/../../client/melbyc"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">50052 is the port used for the development environment (run-dev).</span>
<span class="org-variable-name">MELBYD_PORT</span>=<span class="org-string">"${MELBYD_PORT:-50052}"</span>

<span class="org-function-name">usage</span>()
{
    &gt;&amp;2 cat &lt;&lt;-EOF
<span class="org-sh-heredoc">    usage:   $0 ZSH_KEYMAP_INDICATOR LAST_CMD_EXIT_STATUS SHELL_PID</span>
<span class="org-sh-heredoc">    example: $0 I 128 \$\$</span>
<span class="org-sh-heredoc">EOF</span>
}

<span class="org-function-name">get_view</span>()
{
    <span class="org-string">"${MELBYC_PATH}"</span> <span class="org-sh-escaped-newline">\</span>
        --melbyd-port <span class="org-string">"${MELBYD_PORT}"</span> <span class="org-sh-escaped-newline">\</span>
        view <span class="org-string">"${SCRIPT_ROOT}/sample/melby.lua"</span> <span class="org-sh-escaped-newline">\</span>
        --shell-pid <span class="org-string">"${3:-0}"</span>
}

<span class="org-function-name">main</span>()
{
    get_view <span class="org-string">"$@"</span>
}

main <span class="org-string">"$@"</span>
</pre></div><div class="org-src-container"><pre class="src src-sh" id="nil-12"><span class="org-comment-delimiter"># </span><span class="org-comment">Kubernetes main repo.</span>
<span class="org-builtin">hash</span> -d   <span class="org-variable-name">kk</span>=${<span class="org-variable-name">HOME</span>}/go/src/k8s.io/kubernetes
</pre></div>
</div>
</div>
</div>
</div>
</body>
</html>
